{
  "version": "1.0.0",
  "lastUpdated": "2025-06-10T00:00:00Z",
  "colleges": [
    {
      "id": 1,
      "name": { "en": "College of Information and Computing Sciences" },
      "collegeLogo": "../../images/cics-temp-logo.png",
      "images": ["../../images/cics-temp-banner.png"],
      "stats": {
        "founded": 1998,
        "accreditation": 3
      },
      "slug": "college-of-information-and-computing-sciences",
      "shortName": { "en": "cics" },
      "profile": {
        "tagline": { "en": "Creating innovation, cultivating success" },
        "history": {
          "en": "The College of Information and Computing Sciences is one of the premier colleges in the province for IT Education and services. It aims to produce competitive IT professionals and IT-enabled individuals who will encourage real innovation for the advancement in the digital era of the province and the country as a whole.\nThe college was established in 1998 at MSC Boac Campus through BOT Resolution No. 35, s. 1998 as Institute of Information and Computing Sciences (IICS), a special program to offer Associate in Computer Technology (ACT). Believing that the province needs IT Human Resources, after two years, IICS was adopted as the School of Information and Computing Sciences (SICS), offering two emerging degree programs Bachelor of Science in Information Management and Bachelor of Science in Information Technology to cater to the graduates of ACT. Bachelor of Science in Information Management was also offered in Sta. Cruz Campus. The Bachelor of Science in Information Management (BSIM) was renamed to the Bachelor of Science in Information Systems (BSIS) to adapt to CHED Memorandum Order No. 53 series of 2006.\nAfter a decade, the Marinduque State College had an organizational restructuring wherein two of the big schools in the college were merged. The School of Industrial Technology and the School of Information and Computing Sciences convergence paved the way for the School of Technology's birth in 2016. After three years of being together, the two schools parted ways due to another organizational restructuring and SICS was re-birth in 2019.\nIn 2021, however, SICS was converted to the Institute of Information Systems and Technology (IIST) and became part of the College of Engineering, Information and Industrial Technology (CEIIT) together with the Institute of Engineering and Department of Industrial Technology to centralize the resources of these three into a single college. But once again, fate has plans for this institute and let it navigate its ship on its own. Finally, the former school was converted into a college, banning the name of the College of Information and Computing Sciences (CICS).\nIn 25 years of its existence, CICS has contributed significantly to MSC's mandates in Instruction, Research, Extension, and Production. Currently, both the BS in Information Systems and BS in Information Technology in Boac Campus are Level III Re-Accredited by the Accrediting Agency of Chartered Colleges and Universities in the Philippines (AACCUP), while the BS in Information Systems in Sta. Cruz Campus is Level II Re-Accredited. CICS has produced thousands of IT professionals serving in the province, other parts of the country, and even the global industry. Faculty and students are also actively engaged in research through various local and international presentations and publications. CICS also serves the community by providing relevant extension projects and activities.\nFor the years to come, CICS still commits to giving what their stakeholders deserve through quality education and public service with their mantra, 'WORK IN SILENCE AND LET OUR SUCCESS MAKE OUR NOISE!'"
        },
        "goals": {
          "en": "To produce competitive IT professionals and IT enabled individuals who will encourage real innovation for the advancement in the digital era of the province and the country as a whole."
        },
        "objectives": {
          "en": "To provide quality education in Information and Computing Sciences that will produce globally competitive graduates.\nTo conduct relevant research in Information and Computing Sciences that will contribute to the advancement of knowledge and technology.\nTo extend services to the community through information and computing sciences that will uplift the quality of life of the people."
        },
        "awards": [
          {
            "id": 1,
            "title": {
              "en": "National Digital Challenge - 1st Place"
            },
            "year": 2024,
            "description": {
              "en": "Pollux Rey won the 1st Place in the National Digital Challenge 2024, showcasing their innovative solutions and technical expertise in the field of information technology."
            },
            "icon": "../../images/gold-medal.png"
          },
          {
            "id": 2,
            "title": {
              "en": "DANGAL 2024 - Best Extension Program - CICS TechnoHub"
            },
            "year": 2024,
            "description": {
              "en": "The CICS TechnoHub, a collaborative initiative providing technology support and training to local communities, was recognized as the Best Extension Program at the DANGAL 2024 Awards."
            },
            "icon": "../../images/gold-medal.png"
          },
          {
            "id": 3,
            "title": {
              "en": "AACCUP Level III Re-Accreditation"
            },
            "year": 2024,
            "description": {
              "en": "The Bachelor of Science in Information Systems and Bachelor of Science in Information Technology programs achieved Level III Re-Accreditation from the Accrediting Agency of Chartered Colleges and Universities in the Philippines (AACCUP)."
            },
            "icon": "images/gold-medal.png"
          }
        ]
      },
      "programIds": [1, 2],
      "news": [
        {
          "id": 1,
          "imgUrl": "https://scontent.fmnl4-7.fna.fbcdn.net/v/t39.30808-6/506404512_122258562824074473_1152407901904797597_n.jpg?_nc_cat=104&ccb=1-7&_nc_sid=127cfc&_nc_eui2=AeEriHamDt70_sLHfw9cwUzxJWzewUvvcyMlbN7BS-9zIwfYkBG3ftUaqiYXseUP2p0&_nc_ohc=12i-LibneLwQ7kNvwEphogI&_nc_oc=AdkUh3U9D4xZDf9ZLSyOcSzDpzS5jT22FOVa2rxYsG9Wq91_Xo_0gr-C-uyYKo4iZp4&_nc_zt=23&_nc_ht=scontent.fmnl4-7.fna&_nc_gid=dwEKghIrOZOvuor1YdN4XQ&oh=00_AfMiOtIwSmjZiE3Xmq0jVsgkoa4lmj1hioqDpfmKad5Zsg&oe=6855456B",
          "gallery": [
            "https://placehold.co/600x400",
            "https://placehold.co/600x400",
            "https://placehold.co/600x400"
          ],
          "title": {
            "en": "MARSU Conducts Its 69th Annual Commencement Exercise Class 2025"
          },
          "date": "2025-06-14",
          "description": {
            "en": "The Marinduque State University (MARSU) held its 69th Annual Commencement Exercise for the Class of 2025 on June 14, 2025, at the MSC Boac Campus."
          },
          "content": {
            "en": "As we look back on this special day, we honor the graduates of the College of Information and Computing Sciences, those who pushed through every challenge, stayed up late to finish projects, and kept going even when things got tough this moment is proof that all the hard work was worth it. From sleepless nights to moments of victory, they finally made it !."
          },
          "articleUrl": "/colleges/cics/news/1",
          "isFeatured": true,
          "author": "Infocus Publication",
          "tags": ["Graduation", "Ceremony"]
        },
        {
          "id": 2,
          "imgUrl": "https://scontent.fmnl4-3.fna.fbcdn.net/v/t39.30808-6/386736911_122094549284074473_3777068919360151330_n.png?_nc_cat=109&ccb=1-7&_nc_sid=cc71e4&_nc_eui2=AeFtmPSGmiR8yUuH1WtVdllc3SWxNllQt2HdJbE2WVC3YaGpfoCV9HEc9TxnEDDH4HE&_nc_ohc=i_u9lOwDnK8Q7kNvwEWB4T8&_nc_oc=AdnqltcAjfDs6r8vb0HHmFUD5wRQIvIhSY2CX5nPXvS7aVoWCl4E3zUh46HNr-351L8&_nc_zt=23&_nc_ht=scontent.fmnl4-3.fna&_nc_gid=VAt5aqf0KrJuKUd3NSCqEQ&oh=00_AfNPd7aviP3e1Tk40tkr2igvZ2cOkvQCZPu52GBnUICq-A&oe=685689B2",
          "gallery": [
            "https://placehold.co/600x400",
            "https://placehold.co/600x400",
            "https://placehold.co/600x400"
          ],
          "title": { "en": "A Legendary Send-off" },
          "date": "2025-03-15",
          "description": {
            "en": "A legendary send-off for the graduating class of 2025."
          },
          "content": {
            "en": "It’s never easy to say goodbye to people who helped shape what a team truly means.\nTo our graduates — thank you. You were more than your roles. You were the ones behind the camera, behind the sketches, behind the sound checks. You were there when things got tough, when events popped up out of nowhere, when we had to run from one building to another with barely any rest. You still showed up, even if your house was far, even if your body was tired, even if the weather wasn’t on our side.\nYou captured moments, made people feel seen, and gave meaning to the smallest details. And you didn’t ask for recognition — you simply did what needed to be done, and you did it with heart.\nBarney once said, “𝘞𝘩𝘢𝘵𝘦𝘷𝘦𝘳 𝘺𝘰𝘶 𝘥𝘰 𝘪𝘯 𝘵𝘩𝘪𝘴 𝘭𝘪𝘧𝘦, 𝘪𝘵’𝘴 𝘯𝘰𝘵 𝘭𝘦𝘨𝘦𝘯𝘥𝘢𝘳𝘺 𝘶𝘯𝘭𝘦𝘴𝘴 𝘺𝘰𝘶𝘳 𝘧𝘳𝘪𝘦𝘯𝘥𝘴 𝘢𝘳𝘦 𝘵𝘩𝘦𝘳𝘦 𝘵𝘰 𝘴𝘦𝘦 𝘪𝘵.” And we were here to witness it — the late nights, the technical hiccups, the creative rushes, the laughter in between. It wasn’t always perfect, but it was real. It was honest. And it was legendary because you were part of it.\nWe’ve always worked in the moment — live coverage, real-time adjustments, no time for rewrites. And that’s also how this goodbye feels. Sudden. Fast. But meaningful.\nRobin once said, “𝘛𝘩𝘦 𝘧𝘶𝘵𝘶𝘳𝘦 𝘪𝘴 𝘴𝘤𝘢𝘳𝘺, 𝘣𝘶𝘵 𝘺𝘰𝘶 𝘤𝘢𝘯’𝘵 𝘫𝘶𝘴𝘵 𝘳𝘶𝘯 𝘣𝘢𝘤𝘬 𝘵𝘰 𝘵𝘩𝘦 𝘱𝘢𝘴𝘵 𝘣𝘦𝘤𝘢𝘶𝘴𝘦 𝘪𝘵’𝘴 𝘧𝘢𝘮𝘪𝘭𝘪𝘢𝘳.” And while it’s sad to let go of this chapter, we know you’re ready for what’s next. You’ve already proven how strong, passionate, and reliable you are. And whatever comes after this, we know you’ll carry those same values forward.\nYou’re graduating, but your presence stays with us. In every shoot we do, every layout we polish, every small thing we learned from you — you’ll be there, too.\nFrom all of us still here, thank you for the patience, the guidance, the small talks during long days, and for choosing to stay, even when it was hard.\nYou’ve made your mark. You’ll always be part of our story.\nWith love and pride,\nInfocus Family"
          },
          "articleUrl": "/colleges/cics/news/2",
          "isFeatured": false,
          "author": ["Infocus Publication"],
          "tags": ["Graduation", "Send-off"]
        },
        {
          "id": 3,
          "imgUrl": "https://scontent.fmnl4-7.fna.fbcdn.net/v/t39.30808-6/506341579_1176362401174939_6901917840226455256_n.jpg?_nc_cat=108&ccb=1-7&_nc_sid=127cfc&_nc_eui2=AeH1se3o7Uhx7iM9cmg9Yd2YKk8KFes87fYqTwoV6zzt9kjRqnA5hpt8I0V3O7Gu3AE&_nc_ohc=8xhLDeyB4VEQ7kNvwEbeKbR&_nc_oc=AdnCgchraDAwwkPQQPgoFJsJDOm0z8SeHi_iQy4tj78jWk_KwA0EIDecG1uSy11IUnA&_nc_zt=23&_nc_ht=scontent.fmnl4-7.fna&_nc_gid=cPFcAT3NFGsjsYPH-Nyatw&oh=00_AfNGM64zy4OHIA5HZ_fTdk61PaA940dw5nD1TgFJzX8M6A&oe=68569729",
          "gallery": [
            "https://placehold.co/600x400",
            "https://placehold.co/600x400",
            "https://placehold.co/600x400"
          ],
          "title": { "en": "Happy Independence Day" },
          "date": "2025-06-12",
          "description": {
            "en": "Celebrating the bravery and sacrifices of Filipinos during the revolution."
          },
          "content": {
            "en": "When the revolution broke out in 1896, Filipinos risked their lives to fight for freedom from the colonizers. One of the key figures in the Philippine Revolution who offered shelter, food, and medical aid to the Katipunan revolutionaries was Melchora Aquino, known as Tandang Sora. She was also honored with the titles “Mother of the Katipunan” and “Grand Woman of the Revolution.” As a supporter of the Katipunan, she provided them with rice and cattle for food, as spotted in the photo. #RP612fic"
          },
          "articleUrl": "/colleges/cics/news/3",
          "isFeatured": false,
          "author": ["CiCS Official Page"],
          "tags": ["Independence Day", "History"]
        }
      ]
    },
    {
      "id": 2,
      "name": { "en": "College of Engineering" },
      "slug": "college-of-engineering",
      "shortName": { "en": "ceng" },
      "profile": {
        "tagline": { "en": "Engineering the future, building the nation" },
        "history": {
          "en": "The College of Engineering has been a cornerstone of Marinduque State College since its inception, providing quality education in various engineering disciplines. Established in 1995, it has evolved to meet the changing needs of the industry and society."
        },
        "goals": {
          "en": "To produce highly skilled engineers who can contribute to national development and innovation."
        },
        "awards": []
      },
      "programIds": [2],
      "news": [
        {
          "id": 1,
          "imgUrl": "https://placehold.co/600x400",
          "title": { "en": "Engineering Symposium 2025" },
          "date": "2025-05-20",
          "content": {
            "en": "Join us for the Engineering Symposium 2025 where students will present their innovative projects."
          },
          "articleUrl": "https://example.com/news4",
          "isFeatured": true,
          "author": "Engr. Emily Stone",
          "tags": ["Symposium", "Engineering"]
        },
        {
          "id": 2,
          "imgUrl": "https://placehold.co/600x400",
          "title": { "en": "New Faculty Appointment" },
          "date": "2025-04-15",
          "content": {
            "en": "We are pleased to announce the appointment of Dr. Mark Lee as a new faculty member."
          },
          "articleUrl": "https://example.com/news5",
          "isFeatured": false,
          "author": "Admin",
          "tags": ["Faculty", "Appointment"]
        }
      ]
    },
    {
      "id": 3,
      "name": { "en": "College of Arts and Sciences" },
      "slug": "college-of-arts-and-sciences",
      "shortName": { "en": "cass" },
      "profile": {
        "tagline": { "en": "Cultivating creativity, fostering knowledge" },
        "history": {
          "en": "The College of Arts and Sciences has been integral to the cultural and intellectual development of Marinduque State College since its establishment in 1990. It offers a diverse range of programs that promote critical thinking and creativity."
        },
        "goals": {
          "en": "To nurture creative thinkers and lifelong learners who can contribute to society through the arts and sciences."
        },
        "awards": []
      },
      "programIds": [3],
      "news": [
        {
          "id": 1,
          "imgUrl": "https://placehold.co/600x400",
          "title": { "en": "Art Exhibition 2025" },
          "date": "2025-06-05",
          "content": {
            "en": "The College of Arts and Sciences invites you to the annual Art Exhibition showcasing student artworks."
          },
          "articleUrl": "/colleges/cass/news/1",
          "isFeatured": true,
          "author": "Prof. Sarah Connor",
          "tags": ["Art", "Exhibition"]
        },
        {
          "id": 2,
          "imgUrl": "https://placehold.co/600x400",
          "title": { "en": "New Course Offerings" },
          "date": "2025-05-10",
          "content": {
            "en": "We are excited to announce new course offerings for the upcoming academic year."
          },
          "articleUrl": "/colleges/cass/news/2",
          "isFeatured": false,
          "author": "Admin",
          "tags": ["Courses", "Announcement"]
        }
      ]
    },
    {
      "id": 4,
      "name": { "en": "College of Industrial Technology" },
      "slug": "college-of-industrial-technology",
      "shortName": { "en": "cit" },
      "profile": {
        "tagline": { "en": "Empowering future innovators" },
        "history": {
          "en": "The College of Industrial Technology has been a vital part of Marinduque State University since its establishment, offering programs that equip students with the skills needed for the dynamic industrial environment."
        },
        "goals": {
          "en": "To produce highly skilled technicians who can contribute to the industrial development of the province."
        },
        "awards": []
      },
      "programIds": [4],
      "news": [
        {
          "id": 1,
          "imgUrl": "https://placehold.co/600x400",
          "title": { "en": "Tech Innovators Conference 2025" },
          "date": "2025-07-10",
          "content": {
            "en": "Save the date for the Tech Innovators Conference 2025, featuring industry leaders and experts."
          },
          "articleUrl": "https://example.com/news8",
          "isFeatured": true,
          "author": "Engr. Tony Stark",
          "tags": ["Conference", "Technology"]
        },
        {
          "id": 2,
          "imgUrl": "https://placehold.co/600x400",
          "title": { "en": "Workshop on Emerging Technologies" },
          "date": "2025-06-15",
          "content": {
            "en": "Join our workshop on emerging technologies and learn from the best in the field."
          },
          "articleUrl": "https://example.com/news9",
          "isFeatured": false,
          "author": "Admin",
          "tags": ["Workshop", "Technologies"]
        }
      ]
    },
    {
      "id": 5,
      "name": { "en": "College of Business and Accountancy" },
      "slug": "college-of-business-and-accountancy",
      "shortName": { "en": "cba" },
      "profile": {
        "tagline": { "en": "Driving business excellence" },
        "history": {
          "en": "The College of Business and Management has been a leader in business education in Marinduque since its establishment, providing students with the knowledge and skills needed to excel in the business world."
        },
        "goals": {
          "en": "To develop future business leaders who can drive economic growth and innovation."
        },
        "awards": []
      },
      "programIds": [5],
      "news": [
        {
          "id": 1,
          "imgUrl": "https://placehold.co/600x400",
          "title": { "en": "Business Leaders Forum 2025" },
          "date": "2025-08-20",
          "content": {
            "en": "Don't miss the Business Leaders Forum 2025, a gathering of top executives and entrepreneurs."
          },
          "articleUrl": "https://example.com/news10",
          "isFeatured": true,
          "author": "Mr. Richard Branson",
          "tags": ["Forum", "Business"]
        },
        {
          "id": 2,
          "imgUrl": "https://placehold.co/600x400",
          "title": { "en": "New MBA Program Launch" },
          "date": "2025-07-25",
          "content": {
            "en": "We are thrilled to announce the launch of our new MBA program designed for aspiring business leaders."
          },
          "articleUrl": "https://example.com/news11",
          "isFeatured": false,
          "author": "Admin",
          "tags": ["MBA", "Program"]
        }
      ]
    },
    {
      "id": 6,
      "name": { "en": "College of Education" },
      "slug": "college-of-education",
      "shortName": { "en": "coed" },
      "profile": {
        "tagline": { "en": "Inspiring future educators" },
        "history": {
          "en": "The College of Education has been shaping the future of education in Marinduque since its establishment, providing quality training for aspiring teachers."
        },
        "goals": {
          "en": "To produce competent and compassionate educators who can inspire and lead the next generation."
        },
        "awards": []
      },
      "programIds": [6],
      "news": [
        {
          "id": 1,
          "imgUrl": "https://placehold.co/600x400",
          "title": { "en": "Education Summit 2025" },
          "date": "2025-09-15",
          "content": {
            "en": "Join us at the Education Summit 2025 to explore the future of education."
          },
          "articleUrl": "https://example.com/news12",
          "isFeatured": true,
          "author": "Dr. Maria Montessori",
          "tags": ["Summit", "Education"]
        },
        {
          "id": 2,
          "imgUrl": "https://placehold.co/600x400",
          "title": { "en": "New Scholarship Program" },
          "date": "2025-08-05",
          "content": {
            "en": "We are excited to introduce a new scholarship program for deserving education students."
          },
          "articleUrl": "https://example.com/news13",
          "isFeatured": false,
          "author": "Admin",
          "tags": ["Scholarship", "Education"]
        }
      ]
    }
  ],
  "programs": [
    {
      "id": 1,
      "collegeId": 1,
      "name": { "en": "Bachelor of Science in Information Technology" },
      "version": "2023-2024",
      "description": {
        "en": "The Bachelor of Science in Information Technology program prepares students for a career in the IT industry, focusing on software development, network management, and database administration."
      },
      "curriculum": [
        {
          "id": 1,
          "year": "1st Year",
          "semesters": [
            {
              "id": 1,
              "name": "1st Semester",
              "courses": [
                {
                  "id": 1,
                  "courseName": "introduction to computing",
                  "courseCode": "CC101",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 2,
                  "courseName": "mathematics in the modern world",
                  "courseCode": "GE101 ",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 3,
                  "courseName": "Understanding the Self",
                  "courseCode": "GE102",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 4,
                  "courseName": "Science, Technology and Societ",
                  "courseCode": "GE103 ",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 5,
                  "courseName": "The Contemporary World",
                  "courseCode": "GE104 ",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 6,
                  "courseName": "Logic and Critical Thinking",
                  "courseCode": "GEE101",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 7,
                  "courseName": "Filipino 2 (Malyuning Komunikasyon) ",
                  "courseCode": "GEE102 ",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 8,
                  "courseName": "P.E. 1 (Movement Enhancement)",
                  "courseCode": "GEM101",
                  "units": 2,
                  "prerequisite": "None"
                },
                {
                  "id": 9,
                  "courseName": "NSTP 1",
                  "courseCode": "GEM111",
                  "units": 3,
                  "prerequisite": "None"
                }
              ]
            },
            {
              "id": 2,
              "SemesterName": "2nd Semester",
              "CourseSubject": [
                {
                  "id": 1,
                  "courseName": "Computer Programming 1 ",
                  "courseCode": "CC102",
                  "units": 3,
                  "prerequisite": "CC101"
                },
                {
                  "id": 2,
                  "courseName": "Computer Platform Technologies",
                  "courseCode": "ITP101 ",
                  "units": 3,
                  "prerequisite": "CC101"
                },
                {
                  "id": 3,
                  "courseName": "Purposive Communication ",
                  "courseCode": "GE105",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 4,
                  "courseName": "Readings in Philippine History",
                  "courseCode": "GE106",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 5,
                  "courseName": "Ethics ",
                  "courseCode": "GE107 ",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 6,
                  "courseName": "Art Appreciation",
                  "courseCode": "GE108",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 7,
                  "courseName": "Filipino 2 (Panitikan) ",
                  "courseCode": "GEE103",
                  "units": 3,
                  "prerequisite": "GEE102"
                },
                {
                  "id": 8,
                  "courseName": "P.E. 2 (Fitness Exercises)",
                  "courseCode": "GEM102",
                  "units": 2,
                  "prerequisite": "PATHFIT1"
                },
                {
                  "id": 9,
                  "courseName": "NNSTP 2 ",
                  "courseCode": "GEM112",
                  "units": 3,
                  "prerequisite": "GEM111"
                }
              ]
            }
          ]
        },
        {
          "id": 2,
          "Year": "2nd Year",
          "Semester": [
            {
              "id": 1,
              "SemesterName": "1st Semester",
              "CourseSubject": [
                {
                  "id": 1,
                  "courseName": "Computer Programming 2",
                  "courseCode": "CC103",
                  "units": 3,
                  "prerequisite": "CC102"
                },
                {
                  "id": 2,
                  "courseName": "Discrete Mathematics ",
                  "courseCode": "ITP102",
                  "units": 3,
                  "prerequisite": "GE101, GEE101"
                },
                {
                  "id": 3,
                  "courseName": "Multimedia Arts Solutions",
                  "courseCode": "ITP103",
                  "units": 3,
                  "prerequisite": "CC101"
                },
                {
                  "id": 4,
                  "courseName": "Intoduction to Human Computer Interaction",
                  "courseCode": "ITP104 ",
                  "units": 3,
                  "prerequisite": "CC102"
                },
                {
                  "id": 5,
                  "courseName": "Networking ",
                  "courseCode": "ITP105 ",
                  "units": 3,
                  "prerequisite": "ITP101"
                },
                {
                  "id": 6,
                  "courseName": "Life and Works of Rizal ",
                  "courseCode": "GEM121",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 7,
                  "courseName": "P.E. 3 (Individual/Dual Sports)",
                  "courseCode": "GEM103 ",
                  "units": 3,
                  "prerequisite": "PATHFIT2"
                }
              ]
            },
            {
              "id": 2,
              "SemesterName": "2nd Semester",
              "CourseSubject": [
                {
                  "id": 1,
                  "courseName": "Data Structures and Algorithms",
                  "courseCode": "CC104 ",
                  "units": 3,
                  "prerequisite": "CC103"
                },
                {
                  "id": 2,
                  "courseName": "Application Development and Emerging Technologies",
                  "courseCode": "CC106",
                  "units": 3,
                  "prerequisite": "ACC103"
                },
                {
                  "id": 3,
                  "courseName": "Social and Professional Issues",
                  "courseCode": "ITP106 ",
                  "units": 3,
                  "prerequisite": "CC101"
                },
                {
                  "id": 4,
                  "courseName": "Quantitative Methods",
                  "courseCode": "ITP107",
                  "units": 3,
                  "prerequisite": "GE101"
                },
                {
                  "id": 5,
                  "courseName": "Computer Graphics Programming",
                  "courseCode": "ITP108",
                  "units": 3,
                  "prerequisite": "CC101 "
                },
                {
                  "id": 6,
                  "courseName": "Integrative Programming and Technologie",
                  "courseCode": "ITP109",
                  "units": 3,
                  "prerequisite": "CC103"
                },
                {
                  "id": 7,
                  "courseName": "P.E. 4 (Team Sports) ",
                  "courseCode": "GEM104",
                  "units": 3,
                  "prerequisite": "None"
                }
              ]
            }
          ]
        },
        {
          "id": 3,
          "Year": "3rd Year",
          "Semester": [
            {
              "id": 1,
              "SemesterName": "1st Semester",
              "CourseSubject": [
                {
                  "id": 1,
                  "courseName": "Information Management",
                  "courseCode": "CC105",
                  "units": 3,
                  "prerequisite": "CC104"
                },
                {
                  "id": 2,
                  "courseName": "System Integration and Architecture",
                  "courseCode": "ITP110",
                  "units": 3,
                  "prerequisite": "ITP105, CC106"
                },
                {
                  "id": 3,
                  "courseName": "System Administration and Maintenance",
                  "courseCode": "ITP111",
                  "units": 3,
                  "prerequisite": "ITP106"
                },
                {
                  "id": 4,
                  "courseName": "Methods of Research",
                  "courseCode": "ITP112",
                  "units": 3,
                  "prerequisite": "Regular 3rd Year"
                }
              ],
              "tracks": [
                {
                  "id": 1,
                  "trackName": "Network and Data Security Track",
                  "courses": [
                    {
                      "id": 1,
                      "courseName": "Information Assurance and Security",
                      "courseCode": "ITS111",
                      "units": 3,
                      "prerequisite": "ITP106"
                    },
                    {
                      "id": 2,
                      "courseName": "Internet Technologies",
                      "courseCode": "ITS112",
                      "units": 3,
                      "prerequisite": "ITP106"
                    },
                    {
                      "id": 3,
                      "courseName": "Introduction to Ethical Hacking",
                      "courseCode": "ITS113",
                      "units": 3,
                      "prerequisite": "ITP106"
                    }
                  ]
                },
                {
                  "id": 2,
                  "trackName": "Software Development Track",
                  "courses": [
                    {
                      "id": 1,
                      "courseName": "Object-Oriented Programming",
                      "courseCode": "ITS121",
                      "units": 3,
                      "prerequisite": "CC103"
                    },
                    {
                      "id": 2,
                      "courseName": "Mobile Application Development",
                      "courseCode": "ITS122",
                      "units": 3,
                      "prerequisite": "CC103, ITP104"
                    },
                    {
                      "id": 3,
                      "courseName": "Web Programming 1",
                      "courseCode": "ITS123",
                      "units": 3,
                      "prerequisite": "CC103, ITP104"
                    }
                  ]
                },
                {
                  "id": 3,
                  "trackName": "Graphics Animation Track",
                  "courses": [
                    {
                      "id": 1,
                      "courseName": "Script Writing and Story Board Design",
                      "courseCode": "ITS131",
                      "units": 3,
                      "prerequisite": "ITP108"
                    },
                    {
                      "id": 2,
                      "courseName": "Principles of 3D Animation",
                      "courseCode": "ITS132",
                      "units": 3,
                      "prerequisite": "ITP108"
                    },
                    {
                      "id": 3,
                      "courseName": "Advance 2D Animation",
                      "courseCode": "ITS133",
                      "units": 3,
                      "prerequisite": "ITP108"
                    }
                  ]
                }
              ]
            },
            {
              "id": 2,
              "SemesterName": "2nd Semester",
              "CourseSubject": [
                {
                  "id": 1,
                  "courseName": "IT Project Management",
                  "courseCode": "ITP113",
                  "units": 3,
                  "prerequisite": "Regular 3rd Year"
                },
                {
                  "id": 2,
                  "courseName": "Capstone Project 1",
                  "courseCode": "CAP101",
                  "units": 3,
                  "prerequisite": "Regular 3rd Year"
                },
                {
                  "id": 3,
                  "courseName": "Elective 1 (Seminars and Field Trips)",
                  "courseCode": "ITE101",
                  "units": 3,
                  "prerequisite": "None"
                }
              ],
              "tracks": [
                {
                  "id": 1,
                  "trackName": "Network and Data Security Track",
                  "courses": [
                    {
                      "id": 1,
                      "courseName": "Cyber Security Principles",
                      "courseCode": "ITS114",
                      "units": 3,
                      "prerequisite": "ITS111"
                    },
                    {
                      "id": 2,
                      "courseName": "Cryptography",
                      "courseCode": "ITS115",
                      "units": 3,
                      "prerequisite": "ITS113"
                    }
                  ]
                },
                {
                  "id": 2,
                  "trackName": "Software Development Track",
                  "courses": [
                    {
                      "id": 1,
                      "courseName": "Web Programming 2",
                      "courseCode": "ITS124",
                      "units": 3,
                      "prerequisite": "ITS123"
                    },
                    {
                      "id": 2,
                      "courseName": "Software Engineering 1",
                      "courseCode": "ITS125",
                      "units": 3,
                      "prerequisite": "Regular 3rd Year"
                    }
                  ]
                },
                {
                  "id": 3,
                  "trackName": "Graphics Animation Track",
                  "courses": [
                    {
                      "id": 1,
                      "courseName": "Game Programming",
                      "courseCode": "ITS134",
                      "units": 3,
                      "prerequisite": "ITS132, ITS133"
                    },
                    {
                      "id": 2,
                      "courseName": "Advance 3D Animation",
                      "courseCode": "ITS135",
                      "units": 3,
                      "prerequisite": "ITS132"
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": 4,
          "Year": "4th Year",
          "Semester": [
            {
              "id": 1,
              "SemesterName": "1st Semester",
              "CourseSubject": [
                {
                  "id": 1,
                  "courseName": "Capstone Project 2",
                  "courseCode": "CAP102",
                  "units": 3,
                  "prerequisite": "CAP101"
                },
                {
                  "id": 2,
                  "courseName": "Elective 2",
                  "courseCode": "ITE102",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 3,
                  "courseName": "Elective 3",
                  "courseCode": "ITE103",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 4,
                  "courseName": "Elective 4",
                  "courseCode": "ITE104",
                  "units": 3,
                  "prerequisite": "None"
                }
              ],
              "tracks": [
                {
                  "id": 1,
                  "trackName": "Network and Data Security Track",
                  "courses": [
                    {
                      "id": 1,
                      "courseName": "Cloud Computing",
                      "courseCode": "ITS116",
                      "units": 3,
                      "prerequisite": "ITS112"
                    }
                  ]
                },
                {
                  "id": 2,
                  "trackName": "Software Development Track",
                  "courses": [
                    {
                      "id": 1,
                      "courseName": "Software Engineering 2",
                      "courseCode": "ITS126",
                      "units": 3,
                      "prerequisite": "ITS125"
                    }
                  ]
                },
                {
                  "id": 3,
                  "trackName": "Graphics Animation Track",
                  "courses": [
                    {
                      "id": 1,
                      "courseName": "Sound Production",
                      "courseCode": "ITS136",
                      "units": 3,
                      "prerequisite": "ITS125"
                    }
                  ]
                }
              ]
            },
            {
              "id": 2,
              "SemesterName": "2nd Semester",
              "CourseSubject": [
                {
                  "id": 1,
                  "courseName": "On-the-Job Training",
                  "courseCode": "ITOJT",
                  "units": 3,
                  "prerequisite": "Completed Academic Requirements"
                }
              ]
            }
          ]
        }
      ],
      "outcomes": [],
      "studyPlans": [],
      "careerOpportunities": [
        {
          "id": 1,
          "career": { "en": "" },
          "description": { "en": "" },
          "salaryRange": ""
        }
      ]
    },
    {
      "id": 2,
      "collegeId": 2,
      "name": { "en": "Bachelor of Science in Information Systems" },
      "version": "2023-2024",
      "description": {
        "en": "The Bachelor of Science in Information Systems program focuses on the application of technology in business settings, preparing students for careers in IT management and consulting."
      },
      "curriculum": [
        {
          "id": 1,
          "year": "1st Year",
          "semesters": [
            {
              "id": 1,
              "name": "1st Semester",
              "courses": [
                {
                  "id": 1,
                  "name": { "en": "Introduction to Computing" },
                  "code": "CC101",
                  "units": 3,
                  "prerequisite": null
                },
                {
                  "id": 2,
                  "name": { "en": "Mathematics in the Modern World" },
                  "code": "MMW101",
                  "units": 3,
                  "prerequisite": null
                },
                {
                  "id": 3,
                  "courseName": "Science, Technology and Society",
                  "courseCode": "GE-STS",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 4,
                  "courseName": "Purposive Communication",
                  "courseCode": "GE-PurCom",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 5,
                  "courseName": "Arts Appreciation",
                  "courseCode": "GE-ArtApp",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 6,
                  "courseName": "Understanding the self",
                  "courseCode": "GE-UTS",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 7,
                  "courseName": "Logic and critical Thinking",
                  "courseCode": "GEE101",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 8,
                  "courseName": "Movement Competency Training",
                  "courseCode": "PATHFIT",
                  "units": 2,
                  "prerequisite": "None"
                },
                {
                  "id": 9,
                  "courseName": "National Service Training Program 1",
                  "courseCode": "NSTP1",
                  "units": 3,
                  "prerequisite": "None"
                }
              ]
            },
            {
              "id": 2,
              "name": "2nd Semester",
              "courses": [
                {
                  "id": 1,
                  "courseName": "Computer Programming 1",
                  "courseCode": "CC102",
                  "units": 3,
                  "prerequisite": "CC101"
                },
                {
                  "id": 2,
                  "courseName": "Fundamentals of Information System",
                  "courseCode": "ISP101",
                  "units": 3,
                  "prerequisite": "CC101"
                },
                {
                  "id": 3,
                  "courseName": "Organization and Management Concepts",
                  "courseCode": "ISP103",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 4,
                  "courseName": "Business Process Management",
                  "courseCode": "ISP102",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 5,
                  "courseName": "Living In IT Era",
                  "courseCode": "GEE102",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 6,
                  "courseName": "Modern Communication and Technical Writing",
                  "courseCode": "GEE103",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 7,
                  "courseName": "Ethics",
                  "courseCode": "GE-Ethics",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 8,
                  "courseName": "Exercise-base Fitness Activities",
                  "courseCode": "PATHFIT2",
                  "units": 2,
                  "prerequisite": "PATHFIT1"
                },
                {
                  "id": 9,
                  "courseName": "National Service Training Program 2",
                  "courseCode": "NSTP",
                  "units": 3,
                  "prerequisite": "NSTP1"
                }
              ]
            }
          ]
        },
        {
          "id": 2,
          "year": "2nd Year",
          "semesters": [
            {
              "id": 1,
              "name": "1st Semester",
              "courses": [
                {
                  "id": 1,
                  "courseName": "Computer Programming 2",
                  "courseCode": "CC201",
                  "units": 3,
                  "prerequisite": "CC102"
                },
                {
                  "id": 2,
                  "courseName": "Information Management",
                  "courseCode": "CC202",
                  "units": 3,
                  "prerequisite": "CC101"
                },
                {
                  "id": 3,
                  "courseName": "Professional Issues in Information System",
                  "courseCode": "ISP201",
                  "units": 3,
                  "prerequisite": "GE-Ethics"
                },
                {
                  "id": 4,
                  "courseName": "Information technology Infrastructure and Network Technology",
                  "courseCode": "ISP203",
                  "units": 3,
                  "prerequisite": "cc101"
                },
                {
                  "id": 5,
                  "courseName": "Elective 1: Presentation Skills Using Information Technology",
                  "courseCode": "ISE201",
                  "units": 3,
                  "prerequisite": "GEE 103"
                },
                {
                  "id": 6,
                  "courseName": "Reading in Philippine History",
                  "courseCode": "GE-RPH",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 7,
                  "courseName": "Sports",
                  "courseCode": "PATHFIT3",
                  "units": 3,
                  "prerequisite": "PATHFIT2"
                }
              ]
            },
            {
              "id": 2,
              "name": "2nd Semester",
              "courses": [
                {
                  "id": 1,
                  "courseName": "Data Structure and Algorithms",
                  "courseCode": "CC203",
                  "units": 3,
                  "prerequisite": "CC201"
                },
                {
                  "id": 2,
                  "courseName": "System Analysis and Design",
                  "courseCode": "ISP204",
                  "units": 3,
                  "prerequisite": "All Courses passed prior in all previous semester"
                },
                {
                  "id": 3,
                  "courseName": "Quantitative Methods",
                  "courseCode": "ISP205",
                  "units": 3,
                  "prerequisite": "GE-MMW"
                },
                {
                  "id": 4,
                  "courseName": "Introduction to Human-Computer Interaction",
                  "courseCode": "ISP206",
                  "units": 3,
                  "prerequisite": "cC101"
                },
                {
                  "id": 5,
                  "courseName": "Evaluation of Business Performance",
                  "courseCode": "iSP207",
                  "units": 3,
                  "prerequisite": "ISP102, ISP103, CC202"
                },
                {
                  "id": 6,
                  "courseName": "The Contemporary World",
                  "courseCode": "GE202",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 7,
                  "courseName": "Life and Works of Rizal",
                  "courseCode": "GEM-Rizal",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 8,
                  "courseName": "Sports",
                  "courseCode": "PATHFIT4",
                  "units": 2,
                  "prerequisite": "PATHFIT3"
                }
              ]
            }
          ]
        },
        {
          "id": 3,
          "year": "3rd Year",
          "semesters": [
            {
              "id": 1,
              "name": "1st Semester",
              "courses": [
                {
                  "id": 1,
                  "courseName": "Application Development and Emerging Technologies",
                  "courseCode": "CC301",
                  "units": 3,
                  "prerequisite": "CC201, Com prog 2"
                },
                {
                  "id": 2,
                  "courseName": "Financial Management",
                  "courseCode": "ISP301",
                  "units": 3,
                  "prerequisite": "None"
                },
                {
                  "id": 3,
                  "courseName": "Information System Project Management 1",
                  "courseCode": "ISP302",
                  "units": 3,
                  "prerequisite": "All Courses passed prior in all previous semester"
                },
                {
                  "id": 4,
                  "courseName": "Methods of Research in Information System",
                  "courseCode": "ISP304",
                  "units": 3,
                  "prerequisite": "All Courses passed prior in all previous semester"
                },
                {
                  "id": 5,
                  "courseName": "Elective 2: Web System and Technology",
                  "courseCode": "ISE301",
                  "units": 3,
                  "prerequisite": "CC201"
                },
                {
                  "id": 6,
                  "courseName": "Elective 3: Advance Database System",
                  "courseCode": "ISE302",
                  "units": 3,
                  "prerequisite": "CC202"
                }
              ]
            },
            {
              "id": 2,
              "name": "2nd Semester",
              "courses": [
                {
                  "id": 1,
                  "courseName": "Capstone Project 1 – Proposal Writing and Presentation",
                  "courseCode": "ISCAP301",
                  "units": 3,
                  "prerequisite": "All Courses passed prior in all previous semester"
                },
                {
                  "id": 2,
                  "courseName": "Information System Project Management 2",
                  "courseCode": "ISP305",
                  "units": 3,
                  "prerequisite": "ISP303"
                },
                {
                  "id": 3,
                  "courseName": "Enterprise Resource Plan",
                  "courseCode": "ISP205",
                  "units": 3,
                  "prerequisite": "ISP302, ISP104"
                },
                {
                  "id": 4,
                  "courseName": "Data Mining",
                  "courseCode": "ISP307",
                  "units": 3,
                  "prerequisite": "ISP302"
                },
                {
                  "id": 5,
                  "courseName": "Elective 4: Seminar in Special Information System Topic",
                  "courseCode": "ISE303",
                  "units": 3,
                  "prerequisite": "ISP101"
                }
              ]
            }
          ]
        },
        {
          "id": 4,
          "year": "4th Year",
          "semesters": [
            {
              "id": 1,
              "name": "1st Semester",
              "courses": [
                {
                  "id": 1,
                  "courseName": "Capstone Project 2- Development and Implementation",
                  "courseCode": "iSCAP401",
                  "units": 3,
                  "prerequisite": "ISCAP301"
                },
                {
                  "id": 2,
                  "courseName": "Information System Strategy Management and Acquisition",
                  "courseCode": "ISP401",
                  "units": 3,
                  "prerequisite": "All Courses passed prior in all previous semester"
                },
                {
                  "id": 3,
                  "courseName": "Information Audit and Control",
                  "courseCode": "ISP402",
                  "units": 3,
                  "prerequisite": "All Courses passed prior in all previous semester"
                }
              ]
            },
            {
              "id": 2,
              "name": "2nd Semester",
              "courses": [
                {
                  "id": 1,
                  "courseName": "On the Job Training – 486 Hours",
                  "courseCode": "ISOJT",
                  "units": 6,
                  "prerequisite": "All Courses passed prior in all previous semester"
                }
              ]
            }
          ]
        }
      ],
      "outcomes": [
        {
          "id": 1,
          "outcome": "Demonstrate broad and coherent knowledge and understanding in the core areas of information systems, including systems analysis and design, database management, networking, and information security. Apply critical thinking and problem-solving skills to analyze complex information systems problems and develop effective solutions. Design, implement, and manage information systems that meet organizational needs while adhering to ethical standards and legal requirements. Communicate effectively with diverse audiences, both orally and in writing, to convey technical information related to information systems. Work collaboratively in teams to achieve common goals in the development and implementation of information systems projects. Demonstrate a commitment to lifelong learning by staying current with emerging technologies and trends in the field of information systems."
        }
      ],
      "studyPlans": [],
      "careerOpportunities": []
    },
    {
      "id": 3,
      "collegeId": 3,
      "name": { "en": "Bachelor of Arts in Communication" },
      "curriculum": [],
      "outcomes": [
        {
          "id": 1,
          "outcome": "Define and access information needs; assess and organize information and knowledge. Produce, share and utilize information and knowledge. Communicate in different formats and platforms (print, broadcast, and online). Prepare communication/media plan. Conduct communication and media research and evaluation. Develop and produce communication materials in different formats and platforms. Demonstrate communication management and leadership skills. Develop entrepreneurial capabilities. Adhere to ethical standards and practices. Know and practice rights and responsibilities and accountabilities in the communication profession. Demonstrate a development orientation in communication work. Apply communication theories/models, principles, practices, and tools in development work."
        }
      ],
      "studyPlans": [],
      "careerOpportunities": []
    },
    {
      "id": 4,
      "collegeId": 4,
      "name": { "en": "Bachelor of Science in Industrial Technology" },
      "curriculum": [],
      "outcomes": [],
      "studyPlans": [],
      "careerOpportunities": []
    },
    {
      "id": 5,
      "collegeId": 5,
      "name": { "en": "Bachelor of Science in Business Administration" },
      "curriculum": [],
      "outcomes": [],
      "studyPlans": [],
      "careerOpportunities": []
    },
    {
      "id": 6,
      "collegeId": 6,
      "name": { "en": "Bachelor of Elementary Education" },
      "curriculum": [],
      "outcomes": [],
      "studyPlans": [],
      "careerOpportunities": []
    }
  ],
  "faculty": [
    {
      "id": 1,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1upZV-7vmz6I4vRhvAIlTTwA61_c4nvw1/view?usp=drive_link",
      "name": "Ivy Joy N. Aguiflor, LPT",
      "designation": "University Lecturer",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Secondary Education Major in Mathematics"
        },
        {
          "id": 2,
          "attainment": "Master of Arts in Education Major in Mathematics Teaching(CAR)"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": "Will Economic Capability and Technological Availability Affect Graduate Competencies: An Exploratory Study of BSIT/BSIS Programs"
        }
      ]
    },
    {
      "id": 2,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1aj5s8fWnAGBvHomTM3SLSmpCVOrfsJ2v/view?usp=drive_link",
      "name": "Carmelo O. Alojado",
      "designation": "University Lecturer",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Master in Information Technology (18 Units)"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 3,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1l6Z6ucn2VINOj1WNsvRqN9RTdYDg96jS/view?usp=drive_link",
      "name": "Doreena Joy C. Borja, MIT",
      "designation": "OJT Co-ordinator, Assistant Professor I",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Information Technology"
        },
        {
          "id": 2,
          "attainment": "Master in Information Technology"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 4,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1rGR3s0RCBFt9oNU_KaWe3GU2QfSC2dRF/view?usp=drive_link",
      "name": "Melvin M. Cario",
      "designation": "University Lecturer",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Information Technology"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 5,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1v7U5XzfQH_f2XhL_IQB0ZVXc4BwNI8AR/view?usp=drive_link",
      "name": "Eunice G. De Luna-Malinao, MIT",
      "designation": "Assistant Professor IV",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Information Technology"
        },
        {
          "id": 2,
          "attainment": "Master in Education Management"
        },
        {
          "id": 3,
          "attainment": "Master in Information Technology"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 6,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1uMXADRX06Yr2ROiuW088RRnlCEiRM2kQ/view?usp=drive_link",
      "name": "Villi Dane M. Go, MSCS",
      "designation": "Instructor III",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Computer Science"
        },
        {
          "id": 2,
          "attainment": "Master of Science in Computer Science - Major in Software Development"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": "Geospatial Mapping of MSC Employees and Students for the Prevention of COVID- 19 Transmission."
        },
        {
          "id": 2,
          "title": "Geospatial Mapping of MSC Employees and Students for the Prevention of COVID- 19 Transmission."
        }
      ]
    },
    {
      "id": 7,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1wcJnKKXuoO3prnG9vVlJVHwX1bfxGLCl/view?usp=drive_link",
      "name": "Lorimer L. Imperio, MIT",
      "designation": "Assistant Professor II",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Computer Science"
        },
        {
          "id": 2,
          "attainment": "Master in Information Technology"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 8,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1rmEMKLK3Dq3HOne4yVwgHqnXJJxDTAWd/view?usp=drive_link",
      "name": "Kevin H. Jasmin, LPT",
      "designation": "Instructor I, OJT Coordinator",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Information Technology"
        },
        {
          "id": 2,
          "attainment": "Master in Information Systems"
        },
        {
          "id": 3,
          "attainment": "Master in Information Technology (30 units)"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 9,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1XnCLZh8Yq9ci8a9e656fhy5bpsUuJkHx/view?usp=drive_link",
      "name": "Melvin Jinao",
      "designation": "University Lecturer",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Information Technology – Networking and Data Security"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 10,
      "collegeId": 1,
      "image": "",
      "name": "Raymart Landig, LPT",
      "designation": "University Lecturer",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Education Major in Social Sciences"
        },
        {
          "id": 2,
          "attainment": "Master of Arts in Education Major in Social Science Education (18 units)"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 11,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1DngSUHMmd-_wYvfPDVea8sJxbxZveUId/view?usp=drive_link",
      "name": "Abegail Joy I. Laylay, LPT",
      "designation": "University Lecturer",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Secondary Education Major in Social Sciences"
        },
        {
          "id": 2,
          "attainment": "Master of Arts in Education Major in Social Sciences Teaching"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 12,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1rPJjkmIoQg_HuDU9hO8042hWmEO89MYv/view?usp=drive_link",
      "name": "Beneden M. Logmao, MIS",
      "designation": "Assistant Professor IV, Program Head(BS Information System)",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Information Management"
        },
        {
          "id": 2,
          "attainment": "Master in Information Systems"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": "Ornedo. Parental Engagement on Edukasyong Pantahanan at Pangkabuhayan: ICT Skills and Availability of ICT Equipment in Children’s Learning Amidst Pandemic."
        }
      ]
    },
    {
      "id": 13,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1KAss7-EZqDFTyvT_tarpTJp76LXyEGy8/view?usp=drive_link",
      "name": "Art Jervin L. Magcamit, MIT",
      "designation": "Assistant Professor I, Program Head(BS Information Technology)",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Information Technology"
        },
        {
          "id": 2,
          "attainment": "Master in Information Technology"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 14,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1X2V18iOV5o-wiZEXEfhaDGERdaQgHLpj/view?usp=drive_link",
      "name": "Ronjie Mar L. Malinao, DIT",
      "designation": "College Dean",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Information Technology"
        },
        {
          "id": 2,
          "attainment": "Master in Information Technology"
        },
        {
          "id": 2,
          "attainment": "Doctor in Information Technology"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 15,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1wLa5NfOCV9CEvzJSzqYGo5lJxRlzzMib/view?usp=drive_link",
      "name": "Engr. Jayvi M. Mandalihan, CPE",
      "designation": "University Lecturer",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Computer Engineering"
        },
        {
          "id": 2,
          "attainment": "Master in Information Technology"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": "Student’s Programming Performance Assessment Using Learning Analytics."
        }
      ]
    },
    {
      "id": 16,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1tJrhDzpCvH61tRZ6LEOtLp8BN9wERbfF/view?usp=drive_link",
      "name": "Meynard O. Mangui",
      "designation": "University Lecturer",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Secondary Education Major in MAPHE"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": "Student’s Programming Performance Assessment Using Learning Analytics."
        }
      ]
    },
    {
      "id": 17,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1p5QYjfDaDKOKYMPiJay3CLiL76hHyARB/view?usp=drive_link",
      "name": "Jeffrey M. Marapia, MSCS",
      "designation": "Instructor II",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Computer Science"
        },
        {
          "id": 2,
          "attainment": "Master of Science in Computer Science"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": "Ant Colony Optimization (ACO) for Short Route Calculation Implemented of Transport Mobile Application for Small Network Transport Services in Marinduque."
        }
      ]
    },
    {
      "id": 18,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1tC8WwH7at99oi8q6RRppE4QGnoFGX1Ut/view?usp=drive_link",
      "name": "Christine May L. Nabos, MIT",
      "designation": "Instructor III",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Information Technology"
        },
        {
          "id": 2,
          "attainment": "Master in Information Technology"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 19,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1qMgK0BWSLXT-T2MATQP2jQMGcdjP6MG3/view?usp=drive_link",
      "name": "Julieta Q. Nabos, PH.D",
      "designation": "Assistant Professor V",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Computer Science"
        },
        {
          "id": 2,
          "attainment": "Master of Education in Educational Management"
        },
        {
          "id": 3,
          "attainment": "Master in Information Systems (15 units)"
        },
        {
          "id": 4,
          "attainment": "Doctor of Philosophy in Computer Science"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": "Development, Validation and Acceptance of a Module for Housekeeping Specialization in Technical Vocational Livelihood Track of the Senior High School Education. Philippine e-Journals Psychology and Education: A Multidisciplinary Journal."
        },
        {
          "id": 2,
          "title": "Digital Competencies and Experiences in using Digital Technologies of Public School Teachers in Island Municipalities in Quezon, Philippines. Philippine e-Journals Psychology and Education: A Mutidisciplinary Journal."
        }
      ]
    },
    {
      "id": 20,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1ta3qHpHknzvCFB1oXEHS6Rato7S-CVVL/view?usp=drive_link",
      "name": "Kenneth L. Omiping",
      "designation": "University Lecturer",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Information Technology"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 21,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1qEyDL3ltQ4O5AOYi_vH_YZUJbuF2C7VL/view?usp=drive_link",
      "name": "Jonex M. Ornedo",
      "designation": "University Lecturer",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Information Technology"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 22,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1wAu5sxFvjr0qJb20IzXyiC1qwiuf9KUh/view?usp=drive_link",
      "name": "Wilmer M. Pascual",
      "designation": "University Lecturer",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Computer Science"
        },
        {
          "id": 2,
          "attainment": "Master in Information Technology (30 units)"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": "Pascual. Predictive Modeling for Carabao Milk Quality: Unraveling Key Influencers using Machine Learning Techniques."
        }
      ]
    },
    {
      "id": 23,
      "collegeId": 1,
      "image": "hhttps://drive.google.com/file/d/1qw_fvg96UMGyc2Wc_V60D52b5xTThpJT/view?usp=drive_link",
      "name": "Christopher J. Rebistual",
      "designation": "Assistant Professor IV, OJT Coordinator",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Computer Science"
        },
        {
          "id": 2,
          "attainment": "Master of Engineering Management (27 units)"
        },
        {
          "id": 3,
          "attainment": "Master of Arts in Education"
        },
        {
          "id": 4,
          "attainment": "Doctor of Education"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 24,
      "collegeId": 1,
      "image": "",
      "name": "Coney Marie Rejano, LPT",
      "designation": "University Lecturer",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Education Major in Social Sciences"
        },
        {
          "id": 2,
          "attainment": "Master of Arts in Education Major in Social Science Education (Currently Enrolled)"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 25,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1z4kgmYXbM648rDpiT0M5ZhHdVkPNyCDq/view?usp=drive_link",
      "name": "Joshua R. Relatorres",
      "designation": "University Lecturer",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Information Technology"
        },
        {
          "id": 2,
          "attainment": "Master in Information Technology (CAR)"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 26,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1Ma4Ovi8nJPdBrQktzJMpYcJ7u3xvdw_s/view?usp=drive_link",
      "name": "Aldrin R. Requiz",
      "designation": "Instructor I, OJT Coordinator",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Information Technology"
        },
        {
          "id": 2,
          "attainment": "Master of Science in Information Technology"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 27,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1n4oui8MqOKTh--jGm_ShB2gdXdgmspNU/view?usp=drive_link",
      "name": "Maria Nessa M. Solomon, MAED",
      "designation": "Assistant Professor IV",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Information Management"
        },
        {
          "id": 2,
          "attainment": "Master in Information Systems"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    },
    {
      "id": 28,
      "collegeId": 1,
      "image": "https://drive.google.com/drive/folders/1qo0Y1k4SKo4HZ7gVNP9bdW_qxfLSQBnS?usp=drive_link",
      "name": "Kierven A. Villaruel, MIT",
      "designation": "Instructor III",
      "email": "",
      "educationalAttainment": [
        {
          "id": 1,
          "attainment": "Bachelor of Science in Information Technology"
        },
        {
          "id": 2,
          "attainment": "Master in Information Technology"
        }
      ],
      "publication": [
        {
          "id": 1,
          "title": ""
        }
      ]
    }
  ],
  "staff": [
    {
      "id": 1,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1Y5z3TlqJp5_hbYDY2lbejLQ8gI5-fOaP/view?usp=drive_link",
      "name": "Janebhet R. Nagutom",
      "designation": "Support Staff",
      "email": ""
    },
    {
      "id": 2,
      "collegeId": 1,
      "image": "https://drive.google.com/file/d/1J73P4X_tMM9rwhAbbR6lif01yq6jYbwk/view?usp=drive_link",
      "name": "Danrick A. Mangui",
      "designation": "Technical Staff",
      "email": ""
    }
  ],
  "research": [
    {
      "id": 1,
      "collegeId": 1,
      "title": "Parental Involvement to the Full Implementation of In-Person Classes in the Division of Quezon: Basis for a Parental Support Program (PSP)",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Dr. Leodegario M. Jalos Jr.",
      "indices": "Professional Education",
      "abstract": ""
    },
    {
      "id": 2,
      "collegeId": 1,
      "title": "Semantic Analysis on the Police Lingo in the Narratives of Students of Bachelor of science in Law Enforcement Administration: A Forensic Linguistic Study",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Dr. Susan B. Pineda, Annie M. Ruiz, Vergel L. Mayo",
      "indices": "Language and Communication",
      "abstract": ""
    },
    {
      "id": 3,
      "collegeId": 1,
      "title": "School-Based Management Practices of Public Elementary Schools Division of Lucena City for the School Year 2022",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Dr. Leodegario M. Jalos Jr.",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 4,
      "collegeId": 1,
      "title": "Application Principle of Good Governance in the Implementation of Support Services under the Comprehensive Agrarian Reform (CARP) in the Province of Marinduque: Basis to Formulate New Theory",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Dr. Leodegario M. Jalos Jr.",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 5,
      "collegeId": 1,
      "title": "ISO 9001:2015 Certification Status and Organizational Effectiveness of the Department of Education Division Offices in CALABARZON: Validation of Quality Assurance Principles in the Department of Education",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Dr. Leodegario M. Jalos Jr.",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 6,
      "collegeId": 1,
      "title": "Financial Management Practices of School Heads Related to the Implementation of the Basic Education Learning Continuity Plan(BE-LCP) in the Division of Quezon: Basis for Intervention Program",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Dr. Leodegario M. Jalos Jr.",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 7,
      "collegeId": 1,
      "title": "Physical Facilities Monitoring System Employed by the Elementary Schools in the Third Congressional District of Quezon: Basis for an Enhanced Systematic Monitoring Model",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Dr. Leodegario M. Jalos Jr.",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 8,
      "collegeId": 1,
      "title": "Challenges in Compulsory Acquisition of LNDS Under the Comprehensive Agrarian Reform (CARP) in the Province of Marinduque: Basis to Formulate a Process Model",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Dr. Leodegario M. Jalos Jr.",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 9,
      "collegeId": 1,
      "title": "Male and Female Language Proficiency and Fluency in the Workplace: A Gender Linked Study",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Dr. Susan Barbosa Pineda",
      "indices": "Language and Communication",
      "abstract": ""
    },
    {
      "id": 10,
      "collegeId": 1,
      "title": "Preparedness of Public Elementary School Teachers in Performing Their Tasks Before, During, and After Classroom Observation in Lopez East District, Division of Quezon- Co Author",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Dr. Liza Marie M. Manoos",
      "indices": "Professional Education",
      "abstract": ""
    },
    {
      "id": 11,
      "collegeId": 1,
      "title": "Students' LMS Experience and their Learning Motivation and Academic Performance in Mathematics",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Romalyn DC. Macayaon, Dr. Noel R. Palomares",
      "indices": "Professional Education",
      "abstract": ""
    },
    {
      "id": 12,
      "collegeId": 1,
      "title": "Contextualized and Localized Modules in Araling Panlipunan 9 for Secondary Schools in the Division of Marinduque: A Validation",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Rizalina M. Fidelino, LPT.MA",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 13,
      "collegeId": 1,
      "title": "The Use of Six-Questions Cognitive Model in Developing the Mathematical Skills of Grade 6 Learners",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "John Cris P. Andrade, Noel R. Palomares, EdD",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 14,
      "collegeId": 1,
      "title": "Profiling of Marinduque State College- Bachelor of Secondary Education Graduate's Achievement",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Dexter M. Go, Dr. Liza Marie M. Manoos-Pacia",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 15,
      "collegeId": 1,
      "title": "Effectiveness of Recorded Lecture Video in Teaching Mathematical Measures of Position Among Grade 10 Learners",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Baby Ann P. Motar, Noel R. Palomares, EdD",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 16,
      "collegeId": 1,
      "title": "Students' Perception towards Learning Mathematics and their Academic Performance",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Gliza N. Almonte, Noel R. Palomares, EdD",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 17,
      "collegeId": 1,
      "title": "Level of Preparedness of the Pre-Service Teachers as Assessed by Resource Schools",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Arlene M. Quindoza, Noel R. Palomares, EdD",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 18,
      "collegeId": 1,
      "title": "Predictors of Student's Academic Performance in Mathematics Via Modular Distance Learning",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Camille L. Manggol, Dr. Annalyn J. Decena",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 19,
      "collegeId": 1,
      "title": "Level of Satisfaction of Bachelor of Secondary Education (BSEd) Students on the Auxilliary Services, Marinduque State College",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Noelle Anne S. Pelaez, Dr. Susan B. Pineda",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 20,
      "collegeId": 1,
      "title": "Mathematics Students' Learning Styles and their Academic Achievement",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Althea R. Esplana, Noel R. Palomares, EdD",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 21,
      "collegeId": 1,
      "title": "Causes of Student's Anxiety Towards Mathematics Learning: Input to a Proposed Anxiety Management Strategy",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Antonette M. Magyaya, Rosalyn J. Dasco, RGC, CMHA",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 22,
      "collegeId": 1,
      "title": "Student's Difficulties in Solving Worded Problems Involving Fractions: Input for a Proposed Intervention",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Joyce Ann M. Madriño, Maria Teresa C. Chavez,LPT, MAED",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 23,
      "collegeId": 1,
      "title": "Blended Learning Modality and Academic Performance of Bachelor of Secondary Education (BSEd) Students",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Jean Rose R. Perin, Noel R. Palomares, EdD",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 24,
      "collegeId": 1,
      "title": "The Use of Manipulatives in Developing the Least Mastered Competencies in Mathematics 6",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Mary Joy S. Laririt, Noel R. Palomares, EdD",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 25,
      "collegeId": 1,
      "title": "Mathematics Teaching Strategies in the New Normal: It's Effect on Learner's Academic Performance",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Mary Grace F. Quijano, Noel R. Palomares, EdD",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 26,
      "collegeId": 1,
      "title": "Factors Affecting the Academic Performance of the Bachelor of Secondary Education( (BSEd) Mathematics Students of Marinduque State College",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Maridenn M. Lazo, Noel R. Palomares, EdD",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 27,
      "collegeId": 1,
      "title": "Difficulties Encountered in Applying Mathematical Procedures Among 9 and 10 Students",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Anna Veronica P. Quinto, Noel R. Palomares, EdD",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 28,
      "collegeId": 1,
      "title": "Phytoremediation Potential of Plants Growing on Heavy Metals Zinc (Zn), Copper (Cu) and Manganese (Mn) Contaminated Soil in the Abandoned Consolidated Mining Incorporated (CMI) in Capayang-Ino, Mogpog, Marinduque",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "FIDELINO, John Cedric G., MANUBA, Kayecel L., MONTEAGUDO, Hannesy V., Mae Kristine C. Ogayre, LPT, MD",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 29,
      "collegeId": 1,
      "title": "Diversity and Distribution of Angiosperms in Mt. Malindig",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "CUARTEROS, Charish R., FATALLA, Sam David A., PERNIA, Marc Julius M., Gladys L. San Juan, LPT",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 30,
      "collegeId": 1,
      "title": "Status of Pteridophyte (Ferns) Species Diversity in Mt. Malindig",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "FRANK, Maria Socorro S., MAGPARANGALAN, Alma D., RETARDO, Lea Agnes P., Gladys L. San Juan, LPT",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 31,
      "collegeId": 1,
      "title": "Status of Butterfly Industry in Marinduque",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "ABALAIN, Kian S., CELIZ, Stephanie F., LUMALANG, Tricia Marie V., Maria Victoria M. Miciano, LPT, MAT",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 32,
      "collegeId": 1,
      "title": "Perceived Effects of Video Conferencing in Developing Competencies in Science Courses of BSEd Students",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "CRUZ, John Vincent S., FIDELINO, Rizza F., VALENZUELA, Joyvel R., Maria Victoria M. Miciano, LPT, MAT",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 33,
      "collegeId": 1,
      "title": "Practices of Butterfly Farmers and Breeders in Selected Barangays of Boac: Basis for Developing a Butterfly Farming Techno Guide",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "MOGOL, Jaira Mae, NOVENARIO, Danilo Jr. M., PERALTA, Jessa S., Gerald G. Gutierrez, LPT, DBA",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 34,
      "collegeId": 1,
      "title": "Product Acceptability of Preserved Butterflies for Commercialization",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "DOMINGUEZ, Sara Jane V., MATINING, Nerica Marie S., VILLAVICENCIO, Willa Mae M. Paredes, LPT, MAEd",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 35,
      "collegeId": 1,
      "title": "Secondary school Science Teachers' Level of Familiarity to Laboratory Equipment: Basis for a Proposed Intervention",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "GARCIA, Danel Ann R., PERFIÑAN, Adrian E., REY, Benedicto Jr. B.",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 36,
      "collegeId": 1,
      "title": "Resiliency of Idea leuconoe (Leucono) in Temperature Changes: Basis for a Proposed Project Proposal",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "MALITAO, Jomerose M., MANGANA, Ryan R., MOTOL, Jhean Marie R., Gerald G. Gutierrez, LPT, DBA",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 37,
      "collegeId": 1,
      "title": "The Butterfly Garden Design and Management Practices of Selected Butterfly Farmers in the Province of Marinduque",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "ALEJO, John Axil F., MANINGAS, Anne Louiela, MARCIANO, Arianne F., Gerald G. Gutierrez, LPT, DBA",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 38,
      "collegeId": 1,
      "title": "Assessing Employment Status and Career Outcomes: A Tracer Study of BSEd Physical Sciences Graduates of Marinduque State College Batch 2009 – 2014",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "PAR, Princess P., REANZARES, Roxane F., Noel R. Palomares, LPT, EdD",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 39,
      "collegeId": 1,
      "title": "Teachers' Level of Familiarity to Various Online and Offline Science Applications in Teaching Science Courses",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "DUMARAN, John David B., PATIÑO, Melanie P., Joshua Aaron M. Pagulayan, LPT, MA",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 40,
      "collegeId": 1,
      "title": "The Effects of Pop Culture Trends to the Professional Training of Pre-service Teachers at Marinduque State College",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Brendth J. Constantino, Zhyra Marie M. Penus, Ms. Alchona Wayne T. Maigting",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 41,
      "collegeId": 1,
      "title": "Problems Encountered by the Pedicab Drivers During The Pandemic in the Municipality of Mogpog",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "John Michael Reyes, Clarence Ann M. Nagutom, Dr. Noel R. Palomares",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 42,
      "collegeId": 1,
      "title": "Status of Implementation of the Economic Support and Loan Assistance Ventures Program Amidst Covid-19 Pandemic in the Selected Barangays of Municipality of Mogpog",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Majie Anne L. Mangao, Denchel M. Minga, Mr. Arnel M. Lantita",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 43,
      "collegeId": 1,
      "title": "Documentation of Old Wedding Practices of Lowland Marinduque and Highland Marinduque",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Mary Joy J. Marang, Ronnie Lin P. Rullan, Joshua Aaron M. Pagulayan,LPT. MA",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 44,
      "collegeId": 1,
      "title": "Influencing Factors for Teenage Pregnancy in Buenavista Marinduque: Basis for an Intervention Program",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Lovern P. Ferrer, Elaine F. Privado, Kyle David V. Atienza, LPT. MA",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 45,
      "collegeId": 1,
      "title": "Frequency of Using Digital Learning Resources Related to the Academic Performance of Social Studies Students in Marinduque State College",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Arlene P. Calanog, Marjorie L. Pantoja, Ms. Marife M. Moreno",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 46,
      "collegeId": 1,
      "title": "A Comparative Analysis of the Different Versions of Putong in the Municipality of Boac",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Ma. Dessirie G. Montiano, Evalyn M. Garing, Bernadette N. Del Prado, LPT. MAED",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 47,
      "collegeId": 1,
      "title": "Level of Awareness of the Residents of the Municipality of Buenavista in the R.A 7658 Otherwise Known as the Child Labor Act of the Philippines",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Van Lexerd R. Fiegalan, Clarence F. Privado, Mr. Jimbert S. Cedeño",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 48,
      "collegeId": 1,
      "title": "Assessing the Effects of African Swine Fever To Hog Raiser's Livelihood in Buenavista Marinduque",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Iveelyn L.Fellizar, Roderick J.Fernandez, Mr.Jerahmeel M.Laderas",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 49,
      "collegeId": 1,
      "title": "Influence of Social Media in Decision Making: Presidential Election 2022",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Bianca May R. San Juan, Dr. Noel R. Palomares",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 50,
      "collegeId": 1,
      "title": "Ang Pagkakatatag ng mga Barrio High School sa Bayan ng Gasan: Makasaysayang Dokumentasyon",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Cyrus M. Saliendres, Emerlyn L. Sigue, Mr. Jerahmeel M. Laderas",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 51,
      "collegeId": 1,
      "title": "Parochial Churches of Boac: A Documention",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Monneca M. Marquez, Zarren Keithly M. Malarayap, Mr. Joshua Aaron M. Pagulayan",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 52,
      "collegeId": 1,
      "title": "Influence of Parents to the Choice of Degree Program of their Children",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Joshua P. Quindoza, Dr. Leodegario M. Jalos",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 53,
      "collegeId": 1,
      "title": "Challenges of Bachelor of Secondary Education Students under the care of a Guardian (Non-Parent)",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Florinna M. Casim, Dr. Leodegario M. Jalos",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 54,
      "collegeId": 1,
      "title": "Academic Performance of Bachelor of Secondary Education (BSEd) Social Studies Freshmen Students in Science and Mathematics Subjects Under the Senior High School Curriculum",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Noreeze Angela H. Soleta, Dr. Leodegario M. Jalos",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 55,
      "collegeId": 1,
      "title": "Sports and Recreational Activity Involvement of Bachelor of Secondary Education- Social Studies Students in Marinduque State College",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Jean Nica Delos Santos, Dr. Leodegario M. Jalos",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 56,
      "collegeId": 1,
      "title": "Status of Bachelor of Secondary Education Working Students in Marinduque State College",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Gimalyn M. Miranda, Dr. Leodegario M. Jalos",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 57,
      "collegeId": 1,
      "title": "Perception of Non- Members to the Pantawid Pamilyang Pilipino Program 4P's",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Katherine Molato, Dr. Leodegario M. Jalos",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 58,
      "collegeId": 1,
      "title": "Community Involvement of Pantawid Pamilyang Pilipino Program (4Ps) Beneficiaries in Barangay Dili, Gasan, Marinduque",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Angel Joyce G. Evangelista, Dr. Leodegario M. Jalos",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 59,
      "collegeId": 1,
      "title": "Work Experiences of the Bachelor of the Secondary Education-Social Studies Students Before Entering the College",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Clean S. Saez, Dr. Leodegario M. Jalos",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 60,
      "collegeId": 1,
      "title": "Analysis of the Performance of Bachelor of Secondary Education Social Studies Freshmen Students in Marinduque State College Qualifying Examination",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Dave Q. Palermo, Dr. Leodegario M. Jalos",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 61,
      "collegeId": 1,
      "title": "Academic Performance in Araling Panlipunan of Bachelor of Secondary Education (BSEd) Social Studies Freshmen Students in Their Junior High School Years",
      "publicationYear": "2023",
      "completionYear": "2023",
      "authors": "Mariejoy D. Manuba, Dr. Leodegario M. Jalos",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 62,
      "collegeId": 1,
      "title": "Exploring the Perceived Impact of 1-3-5 Rating Technique to the Language Proficiency and Confidence of the Graduates of Bachelor of elementary Education (BEED)",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Dr. Annalyn J. Decena",
      "indices": "Language and Communication",
      "abstract": ""
    },
    {
      "id": 63,
      "collegeId": 1,
      "title": "Discovering the Local Marindukanon Recreational Games as Input for Learning Module in PE: Basis for Curriculum Enhancement",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Genil S. Labaguis",
      "indices": "General Education",
      "abstract": ""
    },
    {
      "id": 64,
      "collegeId": 1,
      "title": "Inflectional Affixation of Marinduque Tagalog as Used by the Native Speakers in Eastern and Western Marinduque",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Pineda, Susan B. Ph. D.",
      "indices": "Language",
      "abstract": ""
    },
    {
      "id": 65,
      "collegeId": 1,
      "title": "Gender, Age, and Domain in Relation to Language Use of the Native Speakers in West and East Marinduque",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Pineda, Susan B. Ph. D.",
      "indices": "Language",
      "abstract": ""
    },
    {
      "id": 66,
      "collegeId": 1,
      "title": "HAMUSAPAN (Proficiency and Fluency in the Use of L2 Between Male and Female Employees in the Workplace: Basis for an Extension Program",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Pineda, Susan B. Ph. D.",
      "indices": "Language",
      "abstract": ""
    },
    {
      "id": 67,
      "collegeId": 1,
      "title": "Mapping of Selected Social Practices as Intangible Cultural – Heritage in Marinduque",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Del Prado, Bernadette N.",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 68,
      "collegeId": 1,
      "title": "A Narrative Inquiry of Youth Engagement in Environmental Stewardship nas Influenced by Social Actors",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Pagulayan, Joshua Aaron M.",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 69,
      "collegeId": 1,
      "title": "Exploring the Marindukanon Recreational Games as Input for Learning Module in Physical Education",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Labaguis, Genil S.",
      "indices": "MAPEH",
      "abstract": ""
    },
    {
      "id": 70,
      "collegeId": 1,
      "title": "Health Risks Due to Metal Concentrations in Soil and Vegetables from the Six Municipalities of the Island Province in the Philippines",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Ronnel C. Nolos, Christine Joy M. Agarin, Maria Ysabel R. Domino, Pauline B. Bonifacio, Eduardo B. Chan, Doreen R. Mascareñas, Delia B. Senoro",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 71,
      "collegeId": 1,
      "title": "Netizens' Strategies in Learning Vocabularies from the Context of Preferred Social Media Posts",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Annalyn J. Decena, Susan Ramilo-Butac",
      "indices": "Language",
      "abstract": ""
    },
    {
      "id": 72,
      "collegeId": 1,
      "title": "Elicit, Explain, Evaluate: Module Writing Model",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Liza Marie M. Manoos",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 73,
      "collegeId": 1,
      "title": "Spatial distribution of agricultural yields with elevated metal concentration of the island exposed to acid mine drainage",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Delia B. Senoro, Pauline B. Bonifacio, Doreen R. Mascareñas, Carlito B.Tabelin, Froilan P. Ney, Ma. Rowela L. Lamac, Fibor J. Tan",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 74,
      "collegeId": 1,
      "title": "Students Level of Familiarity to Various Online and Offline Mathematical Application as Learning Tool",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Lazarte, John Cornelius M., Rey, Aldrin R., Palomares Noel R. Ph.D.",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 75,
      "collegeId": 1,
      "title": "Students Attributes Related to Mathematical Achievements in Problem Solving Among Senior High Students",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Limpiada, Rhea, Regencia, Amira Grace R., Manoos,Ph.D. Liza Marie M.",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 76,
      "collegeId": 1,
      "title": "Predictors of Student's Academic Performance in Mathematics via Modular Distance Learning",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Labos, Paula Mae M., Manggol, Camille L., Decena Ph.D. Analyn J.",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 77,
      "collegeId": 1,
      "title": "Contemporary Putong: Brass Ensemble Arrangement",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Manlangit, Clint Sean M., Janap, Maricon P.",
      "indices": "Cultural Ed.",
      "abstract": ""
    },
    {
      "id": 78,
      "collegeId": 1,
      "title": "Familiarity of the Youths to Historical Landmarks in Marinduque",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Laylay, Abegail Joy L., Jalos Jr. Ed. D. Leodegario M.",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 79,
      "collegeId": 1,
      "title": "Teaching and Learning with Technology: Assessment of E-learning Digital Tools in Teaching Science in the New Normal",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Logatoc, Princess Idahlia, S., Macayaon, Ramon DC.",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 80,
      "collegeId": 1,
      "title": "Correlation Between Achievement Goal Orientation and Motivated Learning Strategies of BTLEd students of Marinduque State College",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Clarivel M. Miranda",
      "indices": "BTLED",
      "abstract": ""
    },
    {
      "id": 81,
      "collegeId": 1,
      "title": "Perception of 2nd Year Education Students on Social Interactions in Online Learning Environment",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Joshua Aaron M. Pagulayan",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 82,
      "collegeId": 1,
      "title": "Employers' Feedback on the Performance of MSC SED Graduates",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Rizalina M. Fidelino, Raoul J. Magcamit, Arnel M. Lantita, Joshua Aaron M. Pagulayan, Bernadette N. Del Prado",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 83,
      "collegeId": 1,
      "title": "Assessing Pre-Service Teachers' People Skills: Basis for Student Development Programs",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Willa Mae M. Paredes",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 84,
      "collegeId": 1,
      "title": "Pteridophyte Diversity in Marinduque Wildlife Sanctuary, Marinduque, Philippine",
      "publicationYear": "2022",
      "completionYear": "2022",
      "authors": "Roche M. Zoleta",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 85,
      "collegeId": 1,
      "title": "Transition Metals in Freshwater Crustaceans, Tilapia, and Inland Water: Hazardous to the Population of the Small Island Province",
      "publicationYear": "2021",
      "completionYear": "2021",
      "authors": "Christine Joy M. Agarin, Doreen R. Mascareñas, Ronnel Nolos, Eduardo Chan, Delia B. Senoro",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 86,
      "collegeId": 1,
      "title": "Unraveling the Local Folk Dances in Marinduque",
      "publicationYear": "2021",
      "completionYear": "2021",
      "authors": "Dr. Rex Emmanuel L. Asuncion",
      "indices": "Culture and Arts",
      "abstract": ""
    },
    {
      "id": 87,
      "collegeId": 1,
      "title": "Cultural Mapping in the Province of Marinduque, Philippines: Basis for Art Conservancy and Humanities Indigenization in Education",
      "publicationYear": "2021",
      "completionYear": "2021",
      "authors": "Rex Emmanuel L. Asuncion",
      "indices": "Culture and Arts",
      "abstract": ""
    },
    {
      "id": 88,
      "collegeId": 1,
      "title": "Unraveling The Local Folk Dances of Marinduque",
      "publicationYear": "2021",
      "completionYear": "2021",
      "authors": "Rex Emmanuel L. Asuncion, Genil S. Labaguis",
      "indices": "Culture and Arts",
      "abstract": ""
    },
    {
      "id": 89,
      "collegeId": 1,
      "title": "Netizens' Strategies in Learning Vocabularies from the Context of Preferred Social Media Posts",
      "publicationYear": "2021",
      "completionYear": "2021",
      "authors": "Annalyn J. Decena, Susam Ramilo-Butac",
      "indices": "Language and Communication",
      "abstract": ""
    },
    {
      "id": 90,
      "collegeId": 1,
      "title": "Elicit, Explain, Evaluate: Module Writing Model",
      "publicationYear": "2021",
      "completionYear": "2021",
      "authors": "Liza Marie M. Manoos",
      "indices": "Professional Education",
      "abstract": ""
    },
    {
      "id": 91,
      "collegeId": 1,
      "title": "Discovering Marindukanon Recreational Games as Input for Learning Module in Physical Education: Input for Curriculum Enhancement",
      "publicationYear": "2021",
      "completionYear": "2021",
      "authors": "Genil S. Labaguis",
      "indices": "Culture and Arts",
      "abstract": ""
    },
    {
      "id": 92,
      "collegeId": 1,
      "title": "Acquired Skills and the Competencies in Bread and Pastry Production of Grade 11 TVL Senior High School Students",
      "publicationYear": "2021",
      "completionYear": "2021",
      "authors": "Frannie M. Rodil",
      "indices": "Home Economics",
      "abstract": ""
    },
    {
      "id": 93,
      "collegeId": 1,
      "title": "Survey on the Reading Difficulties of K-12 Learners in Selected TagalogSpeaking Provinces: Basis for Intervention",
      "publicationYear": "2021",
      "completionYear": "2021",
      "authors": "Annalyn J. Decena",
      "indices": "Language",
      "abstract": ""
    },
    {
      "id": 94,
      "collegeId": 1,
      "title": "Performance of the Graduates of MSC Laboratory School (Preschool) as Perceived by their Parents and Teachers in the School they are Enrolled In.",
      "publicationYear": "2021",
      "completionYear": "2021",
      "authors": "Fernandez, Charissa May R.",
      "indices": "General Education",
      "abstract": ""
    },
    {
      "id": 95,
      "collegeId": 1,
      "title": "Taxonomies and Trends in Baccalaureate Researchers: A Documentary Analysis of BSEd Social Studies Theses from 2015 to 2019",
      "publicationYear": "2021",
      "completionYear": "2021",
      "authors": "Pagulayan, Joshua Aaron M., Marinduque, Jairanie S.",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 96,
      "collegeId": 1,
      "title": "A Tracer Study of the Marinduque State College BSEd Mathematics Graduates: Their Employability, Attributes and Competence",
      "publicationYear": "2021",
      "completionYear": "2021",
      "authors": "Palomares, Noel R., Macayaon, Romalyn DC",
      "indices": "Mathematics",
      "abstract": ""
    },
    {
      "id": 97,
      "collegeId": 1,
      "title": "Satisfaction Level of the College of Education, Arts and Social Sciences – Institute of Education Faculty re: Rank and Employment Status: A Basis for Faculty Development Programs",
      "publicationYear": "2021",
      "completionYear": "2021",
      "authors": "Paredes, Willa Mae M.",
      "indices": "Professional Education",
      "abstract": ""
    },
    {
      "id": 98,
      "collegeId": 1,
      "title": "Profile of Marinduque State College BSEd Social Studies Graduates from 2009 to 2019: A Tracer Study",
      "publicationYear": "2021",
      "completionYear": "2021",
      "authors": "Pagulayan, Joshua Aaron M., Fidelino, Rizalina M., Del Prado, Bernadette N., Magcamit, Raoul J., Lantita, Arnel M.",
      "indices": "Social Studies",
      "abstract": ""
    },
    {
      "id": 99,
      "collegeId": 1,
      "title": "Difficulty Encountered by Non-MAPHE Teachers in Teaching Schools in the Division of Marinduque",
      "publicationYear": "2021",
      "completionYear": "2021",
      "authors": "Odias, Erika G., Balut, SharmaineB.",
      "indices": "MAPEH",
      "abstract": ""
    },
    {
      "id": 100,
      "collegeId": 1,
      "title": "Learning Styles of Second Year Institute of Education (IEd) Students: A Survey",
      "publicationYear": "2021",
      "completionYear": "2021",
      "authors": "Laylay, Alexandra Ysabel S, Fidelino, Rizalina M.",
      "indices": "Professional Education",
      "abstract": ""
    },
    {
      "id": 101,
      "collegeId": 1,
      "title": "A Tracer Study of Bachelor of Secondary Education (BSED) Major in Physical Sciences Graduates of Marinduque State College School of Education (2015- 2019): An input to Curricular Development",
      "publicationYear": "2021",
      "completionYear": "2021",
      "authors": "Willa Mae M. Paredes, Maria Victoria M. Miciano",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 102,
      "collegeId": 1,
      "title": "Subsistence of Arts and Cultural Heritage in the Island Province of Marinduque, Philippines: Education Challenges in the New Normal",
      "publicationYear": "2021",
      "completionYear": "2021",
      "authors": "Rex Emmanuel L. Asuncion",
      "indices": "Cultural Education",
      "abstract": ""
    },
    {
      "id": 103,
      "collegeId": 1,
      "title": "Home-schooling on a Crisis: Teachers' Parents' and Learners' Experiences During this COVID- 19 Pandemic",
      "publicationYear": "2020",
      "completionYear": "2020",
      "authors": "Annalyn J. Decena",
      "indices": "Professional Education",
      "abstract": ""
    },
    {
      "id": 104,
      "collegeId": 1,
      "title": "Survey on the Reading Difficulties of K12 Learners in Selected Tagalog-Speaking Provinces: Basis for Intervention",
      "publicationYear": "2020",
      "completionYear": "2020",
      "authors": "Dr. Annalyn Jawili- Decena",
      "indices": "Language and Communication",
      "abstract": ""
    },
    {
      "id": 105,
      "collegeId": 1,
      "title": "Transition Metals in Freshwater Crustaceans, Tilapia, and Inland Water: Hazardous to the Population of the Small Island Province",
      "publicationYear": "2020",
      "completionYear": "2020",
      "authors": "Christine Joy M. Agarin, Doreen R. Mascareñas, Ronnel Nolos, Eduardo Chan, Delia B. Senoro",
      "indices": "Science",
      "abstract": ""
    },
    {
      "id": 106,
      "collegeId": 1,
      "title": "Spatial distribution of agricultural yields with elevated metal concentration of the island exposed to acid mine drainage",
      "publicationYear": "2020",
      "completionYear": "2020",
      "authors": "Delia B. Senoro, Pauline B. Bonifacio, Doreen R. Mascareñas, Carlito B.Tabelin, Froilan P. Ney, Ma. Rowela L. Lamac, Fibor J. Tan",
      "indices": "Science",
      "abstract": ""
    }
  ],
  "extensions": [
    {
      "id": 1,
      "collegeId": 1,
      "title": {
        "en": "Launching of the BP-TUROL for the 11 cooperating schools in Marinduque"
      },
      "publicationYear": "September 20, 2024",
      "completionYear": "N/A",
      "authors": ["N/A"],
      "indices": ["N/A"],
      "abstract": { "en": "" }
    },
    {
      "id": 2,
      "collegeId": 1,
      "title": { "en": "Implementation of the BP-TUROL Program" },
      "publicationYear": "January 22, 2025",
      "completionYear": "N/A",
      "authors": ["N/A"],
      "indices": ["N/A"],
      "abstract": { "en": "" }
    }
  ],
  "studentAchievements": [
    {
      "id": 1,
      "collegeId": 1,
      "type": { "en": "" },
      "description": { "en": "" }
    }
  ],
  "studentProfiles": [
    {
      "id": 1,
      "collegeId": 1,
      "programId": 1,
      "rate": "",
      "image": ""
    }
  ],
  "studentOrganizations": [
    {
      "id": 1,
      "collegeId": 1,
      "name": { "en": "" },
      "designation": { "en": "" },
      "image": ""
    }
  ],
  "studentAccomplishments": [
    {
      "id": 1,
      "collegeId": 1,
      "title": { "en": "" },
      "description": { "en": "" },
      "image": ""
    }
  ],
  "alumni": [
    {
      "id": 1,
      "collegeId": 1,
      "tracer": [
        {
          "graduates_summary": {
            "total_graduates": 586,
            "total_respondents": 534,
            "response_rate": "90.8%",
            "programs": {
              "BSIT": {
                "graduates": 431,
                "respondents": 429
              },
              "BSIS": {
                "graduates": 103,
                "respondents": 103
              }
            }
          },
          "employment_rates": {
            "overall": {
              "BSIT": "80.0%",
              "BSIS": "80.2%"
            },
            "by_graduation_year": {
              "2018-2019": {
                "BSIT": "90.4%",
                "BSIS": "84.4%"
              },
              "2019-2020": {
                "BSIT": "86.3%",
                "BSIS": "64.7%"
              },
              "2021-2022": {
                "BSIT": "82.1%",
                "BSIS": "82.8%"
              },
              "2022-2023": {
                "BSIT": "71.5%",
                "BSIS": "76.0%"
              }
            }
          },
          "employment_characteristics": {
            "job_status": {
              "BSIT": {
                "regular_permanent": "44%",
                "contractual": "35%",
                "temporary": "11%",
                "self_employed": "6%",
                "casual": "4%"
              },
              "BSIS": {
                "regular_permanent": "40%",
                "contractual": "37%",
                "temporary": "12%",
                "casual": "6%",
                "self_employed": "5%"
              }
            },
            "top_occupations": {
              "BSIT": [
                "Clerks (26%)",
                "Technicians and Associate Professionals (18.7%)",
                "Service, Shop, and Sales Workers (16.8%)"
              ],
              "BSIS": [
                "Professionals (20%)",
                "Service, Shop, and Sales Workers (20%)",
                "Clerks (18.7%)"
              ]
            }
          },
          "curriculum_relevance": {
            "BSIT": {
              "relevant": "81.0%",
              "not_relevant": "19.0%"
            },
            "BSIS": {
              "relevant": "75.7%",
              "not_relevant": "24.3%"
            }
          },
          "industry_distribution": {
            "top_industries": {
              "BSIT": [
                "Various IT Companies (24%)",
                "Community/Social/Personal Services (15.5%)",
                "Education (7.8%)"
              ],
              "BSIS": [
                "Various IT Companies (23.2%)",
                "Financial Services (14.3%)",
                "Community/Social/Personal Services (12.5%)"
              ]
            }
          }
        }
      ]
    }
  ],
  "alumniTestimonials": [
    {
      "id": 1,
      "alumniId": 1,
      "image": "",
      "name": { "en": "" },
      "story": { "en": "" }
    }
  ],
  "events": [
    {
      "id": 1,
      "title": {
          "en": "Request for Academic Program Evaluation of Candidates for Midyear (November 2025) and April 2026 Graduation; 10% Commencement Exercises",
          "fil": "Paghingi ng Ebalwasyon ng Akademikong Programa para sa mga Kandidato sa Midyear (Nobyembre 2025) at Araw ng Pagtatapos sa Abril 2026; 10% ng Seremonya ng Pagtatapos"
      },
      "description": {
          "en": "Evaluation of academic programs for candidates graduating in Midyear 2025 and April 2026 as part of commencement preparation.",
          "fil": "Pagsusuri ng akademikong programa ng mga kandidato para sa pagtatapos sa Midyear 2025 at Abril 2026 bilang bahagi ng paghahanda sa seremonya ng pagtatapos."
      },
      "date": "2025-07-01 - 2025-07-11",
      "day": { "en": "Monday to Friday", "fil": "Lunes hanggang Biyernes" },
      "category": "graduation",
      "tags": ["academic", "deadline","graduation"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 2,
      "title": {
          "en": "Online Enrollment Period for JHS (Grade 7-10) and Incoming 1st Year College Students",
          "fil": "Panahon ng Online Enrollment para sa Junior High School (Grade 7-10) at mga Papasok na Unang Taon na Estudyante sa Kolehiyo"
      },
      "description": {
          "en": "Online enrollment for Junior High School (Grades 7-10) and incoming first-year college students.",
          "fil": "Online enrollment para sa Junior High School (Grade 7-10) at mga bagong pasok sa kolehiyo."
      },
      "date": "2025-06-18 - 2025-07-11",
      "day": { "en": "Monday to Friday", "fil": "Lunes hanggang Biyernes" },
      "category": "enrollment",
      "tags": ["academic", "enrollment"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 3,
      "title": {
          "en": "Online enrollment for Old College Students (2nd Year - 4th Year), Transferees, Returning Students, 2nd Coursers, CTPE and Graduate (Masters and Doctorate) Students",
          "fil": "Online enrollment para sa mga dating estudyante sa kolehiyo (Ika-2 hanggang Ika-4 na Taon), mga transferee, nagbabalik na estudyante, pangalawang kurso, CTPE, at mga mag-aaral sa antas gradwado (Masterado at Doktorado)."
      },
      "description": {
          "en": "Online enrollment for returning college students, transferees, second coursers, CTPE, and graduate students.",
          "fil": "Online enrollment para sa mga dating kolehiyo, transferee, nagbabalik na estudyante, kumukuha ng ikalawang kurso, CTPE, at mga mag-aaral sa graduate studies."
      },
      "date": "2025-07-07 - 2025-07-25",
      "day": { "en": "Monday to Friday", "fil": "Lunes hanggang Biyernes" },
      "category": "enrollment",
      "tags": ["academic", "enrollment"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 4,
      "title": {
          "en": "Filing of Letter Request for Special/Petition Class (SPC) / Evaluation Period",
          "fil": "Pagsusumite ng Liham ng Kahilingan para sa Special o Petition Class (SPC) / Panahon ng Ebalwasyon"
      },
      "description": {
          "en": "Filing of letter request for SPC or Petition Class and evaluation of related documents.",
          "fil": "Pagsusumite ng liham ng kahilingan para sa SPC o Petition Class at pagsusuri ng mga kaugnay na dokumento."
      },
      "date": "2025-07-14 - 2025-07-18 / 2025-07-21 - 2025-07-25",
      "day": { "en": "Monday to Friday", "fil": "Lunes hanggang Biyernes" },
      "category": "Special Class",
      "tags": ["academic", "special class", "evaluation"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 5,
      "title": {
          "en": "Submission of Requirements (hard copy) of New Students to ARO",
          "fil": "Pagsusumite ng mga kinakailangang dokumento (hard copy) ng mga bagong estudyante sa ARO."
      },
      "description": {
          "en": "Submission of hard copy documents of new students to the ARO.",
          "fil": "Pagbibigay ng hard copy ng mga dokumento ng bagong estudyante sa ARO."
      },
      "date": "2025-07-28 - 2025-08-08",
      "day": { "en": "Monday to Friday", "fil": "Lunes hanggang Biyernes" },
      "category": "admission",
      "tags": ["academic", "deadline","submission"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 6,
      "title": {
          "en": "Filing of Application for Midyear (November) 2025 Graduation / 70th Commencement Exercises",
          "fil": "Pagsusumite ng aplikasyon para sa Midyear (Nobyembre) 2025 Pagtatapos / ika-70 na Seremonya ng Pagtatapos."
      },
      "description": {
          "en": "This process involves submitting an application to participate in the Midyear 2025 Graduation and the 70th Commencement Exercises, ensuring eligibility and preparation for the ceremony.",
          "fil": "Ang prosesong ito ay kinapapalooban ng pagsusumite ng aplikasyon upang makilahok sa Midyear 2025 Pagtatapos at ika-70 na Seremonya ng Pagtatapos, upang matiyak ang karapatan at kahandaan para sa programa."
      },
      "date": "2025-09-29 - 2025-10-10",
      "day": { "en": "Monday to Friday", "fil": "Lunes hanggang Biyernes" },
      "category": "graduation",
      "tags": ["academic", "graduation"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 7,
      "title": {
          "en": "First Day of Service of Faculty",
          "fil": "Unang Araw ng Paglilingkod ng mga guro"
      },
      "description": {
          "en": "The first day when faculty members begin their duties for the academic year.",
          "fil": "Ang unang araw kung kailan nagsisimula ang mga guro sa kanilang tungkulin para sa akademikong taon."
      },
      "date": "2025-07-21",
      "day": { "en": "Monday", "fil": "Lunes" },
      "category": "academic",
      "tags": ["service","faculty"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 8,
      "title": {
          "en": "Faculty In-Service Training",
          "fil": "Pagsasanay ng mga guro sa Serbisyo"
      },
      "description": {
          "en": "A training program designed for faculty members to enhance their knowledge, skills, and professional development.",
          "fil": "Isang programa ng pagsasanay na inilaan para sa mga guro upang mapahusay ang kanilang kaalaman, kasanayan, at propesyonal na pag-unlad."
      },
      "date": "2025-07-21 - 2025-07-25",
      "day": { "en": "Monday to Friday", "fil": "Lunes hanggang Biyernes" },
      "category": "Training",
      "tags": ["training", "faculty"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 9,
      "title": {
          "en": "First Day of Regular Classes and F2F Student Orientation",
          "fil": "Unang Araw ng Regular na Klase at F2F na Pagsasanay para sa mga Estudyante"
      },
      "description": {
          "en": "A day marking the start of regular classes alongside face-to-face orientation for students to guide them on policies, programs, and expectations for the academic year.",
          "fil": "Isang araw ng pagsisimula ng mga regular na klase kasabay ng harapang oryentasyon para sa mga estudyante upang gabayan sila sa mga patakaran, programa, at mga inaasahan sa akademikong taon."
      },
      "date": "2025-07-28",
      "day": { "en": "Monday", "fil": "Lunes" },
      "category": "academic",
      "tags": ["academic", "classes", "orientation"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 10,
      "title": {
          "en": "Last day of Adding/Changing of Subjects",
          "fil": "Huling Araw ng Pagdaragdag/Pagbabago ng mga Paksa"
      },
      "description": {
          "en": "The last day for students to add or change their subjects for the current semester.",
          "fil": "Ang huling araw para sa mga estudyante na magdagdag o magpalit ng kanilang mga asignatura para sa kasalukuyang semestre."
      },
      "date": "2025-08-01",
      "day": { "en": "Friday", "fil": "Biyernes" },
      "category": "Subjects",
      "tags": ["academic", "deadline", "subjects"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 11,
      "title": {
          "en": "Last Day of Dropping of Subjects",
          "fil": "Huling Araw ng Pag-drop ng mga Asignatura"
      },
      "description": {
          "en": "The last day for students to drop or withdraw from their subjects for the current semester.",
          "fil": "Ang huling araw para sa mga estudyante na mag-drop o mag-withdraw ng kanilang mga asignatura sa kasalukuyang semestre"
      },
      "date": "2025-09-15",
      "day": { "en": "Monday", "fil": "Lunes" },
      "category": "Subjects",
      "tags": ["academic", "deadline", "dropping", "subjects"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 12,
      "title": {
          "en": "Last Day of Settlement of Admission Requirements of New Students enrolled during the 1st Semester AY 2025-2026",
          "fil": "Huling Araw ng Pagsasaayos ng mga Kinakailangang Dokumento ng mga Bagong Estudyanteng Nag-enroll sa Unang Semestre ng TA 2025-2026."
      },
      "description": {
          "en": "The last day for new students to submit and have their admission requirements processed for enrollment in the first semester of the academic year 2025-2026.",
          "fil": "Ang huling araw para maisumite at maproseso ng mga bagong estudyante ang kanilang mga kinakailangang dokumento para sa enrollment sa unang semestre ng taong akademiko 2025-2026."
      },
      "date": "2025-09-15 - 2025-079-19",
      "day": { "en": "Monday to Friday", "fil": "Lunes hanggang Biyernes" },
      "category": "admission",
      "tags": ["academic", "deadline", "admission", "requirements"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id":13,
      "title": {
          "en": "Midterm Examinations",
          "fil": "Pagsusulit sa Kalagitnaan ng Termino"
      },
      "description": {
          "en": "An exam conducted midway through the semester to assess students’ knowledge and progress on the topics covered.",
          "fil": "Isang pagsusulit na isinasagawa sa kalagitnaan ng semestre upang masukat ang kaalaman at pag-unlad ng mga estudyante sa mga napag-aralang aralin."
      },
      "date": "2025-09-25 - 2025-09-27",
      "day": { "en": "Monday to Wednesday", "fil": "Lunes hanggang Miyerkules" },
      "category": "Examination",
      "tags": ["academic", "examination", "midterm"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 14,
      "title": {
          "en": "Submission of Final Manuscript (Thesis/Dissertation) of Candidates for Midyear (November) 2025 Graduation",
          "fil": "Pagsusumite ng Pinal na Manuskripto (Thesis/Dissertation) ng mga Kandidato para sa Midyear (Nobyembre) 2025 Pagtatapos."
      },
      "description": {
          "en": "The process of submitting the final copy of the thesis or dissertation by candidates for the Midyear (November) 2025 Graduation as part of their graduation requirements.",
          "fil": "Ang proseso ng pagsusumite ng pinal na kopya ng thesis o dissertation ng mga estudyanteng kandidato para sa Midyear (Nobyembre) 2025 Pagtatapos bilang bahagi ng kanilang mga graduation requirements."
      },
      "date": "2025-11-17",
      "day": { "en": "Monday", "fil": "Lunes" },
      "category": "graduation",
      "tags": ["academic", "graduation", "thesis"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 15,
      "title": {
          "en": "Final Examinations",
          "fil": "Pangwakas na Pagsusulit"
      },
      "description": {
          "en": "An examination conducted at the end of the semester to assess the students' overall knowledge and understanding of all topics covered.",
          "fil": "Isang pagsusulit na isinasagawa sa pagtatapos ng semestre upang sukatin ang kabuuang kaalaman at pag-unawa ng mga estudyante sa lahat ng paksang tinalakay."
      },
      "date": "2025-11-27 - 2025-11-29",
      "day": { "en": "Thursday to Saturday", "fil": "Huwebes hanggang Sabado" },
      "category": "Examination",
      "tags": ["academic", "examination", "finals"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 16,
      "title": {
          "en": "End of 1st Semester AY 2025-2026 and Last Day of Completion of Incomplete (INC.) Rating obtained during the 1st Semester AY 2024-2025 (for the subjects without advanced subjects)",
          "fil": "Pagtatapos ng Unang Semestre ng AY 2025-2026 at Huling Araw ng Pagtatapos ng Incomplete (INC.) na Marka na nakuha noong Unang Semestre ng AY 2024-2025 (para sa mga asignaturang walang kasunod na advanced na asignatura)."
      },
      "description": {
          "en": "The end of the 1st semester of AY 2025-2026 and the final deadline for students to complete their Incomplete (INC.) grades obtained during the 1st semester of AY 2024-2025, applicable only to subjects without advanced courses.",
          "fil": "Ang araw ng pagtatapos ng unang semestre ng AY 2025-2026 at ang itinakdang huling araw para sa mga estudyante na makumpleto ang kanilang Incomplete (INC.) na marka mula sa unang semestre ng AY 2024-2025, para lamang sa mga asignaturang walang kasunod na advanced na kurso."
      },
      "date": "2025-11-08",
      "day": { "en": "Saturday", "fil": "Sabado" },
      "category": "academic",
      "tags": ["academic", "incomplete", "deadline", "semester"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 17,
      "title": {
          "en": "Semestral Break",
          "fil": "Pansamantalang Bakasyon sa Pagitan ng mga Semestre"
      },
      "description": {
          "en": "A break period for students and faculty after the end of a semester and before the start of the next one.",
          "fil": "Isang panahon ng pahinga para sa mga estudyante at guro matapos ang pagtatapos ng semestre bago magsimula ang susunod na semestre."
      },
      "date": "2025-12-01 - 2025-12-14",
      "day": { "en": "Monday to Friday", "fil": "Lunes hanggang Biyernes" },
      "category": "Semester Break",
      "tags": ["academic", "semester"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 18,
      "title": {
          "en": "Online Admissiion of Transferees, Returning and Graduate Students for 2nd Semester AY 2025-2026",
          "fil": "Online Admission ng mga Transferee, Nagbabalik na Estudyante at mga Mag-aaral sa Antas Gradwado para sa Ikalawang Semestre ng AY 2025-2026"

      },
      "description": {
          "en": "An online application and admission process for transferees, returning students, and graduate-level students for the second semester of Academic Year 2025-2026.",
          "fil": "Isang online na proseso ng aplikasyon at pagtanggap para sa mga transferee, nagbabalik na estudyante, at mga mag-aaral sa antas gradwado para sa ikalawang semestre ng taong akademiko 2025-2026."
      },
      "date": "2025-12-01 - 2025-012-05",
      "day": { "en": "Monday to Friday", "fil": "Lunes hanggang Biyernes" },
      "category": "enrollment",
      "tags": ["academic", "admission", "transferees", "graduate"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 19,
      "title": {
          "en": "Last Day of Online Posting of Grades of Faculty",
          "fil": "Huling Araw ng Online na Paglalathala ng mga Grado ng mga Guro"
      },
      "description": {
          "en": "The final deadline for faculty to post students' official grades in the online system for the current semester.",
          "fil": "Ang itinakdang huling araw para sa mga guro na mag-post ng mga opisyal na grado ng mga estudyante sa online system para sa kasalukuyang semestre."
      },
      "date": "2025-12-07",
      "day": { "en": "Sunday", "fil": "Linggo" },
      "category": "Grades",
      "tags": ["academic", "deadline", "grades", "faculty"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 20,
      "title": {
          "en": "Submission of Official Grading Sheets(Hard Copies) to ARO",
          "fil": "Pagsusumite ng Opisyal na mga Sheet ng Pagmamarka (Hard Copies) sa ARO"
      },
      "description": {
          "en": "The process of submitting the printed official grading sheets by faculty to the Academic Records Office (ARO) as part of the documentation of students' grades.",
          "fil": "Ang proseso ng pagsumite ng naka-print na opisyal na grading sheets ng mga guro sa Academic Records Office (ARO) bilang bahagi ng dokumentasyon ng mga grado ng estudyante."
      },
      "date": "2025-12-09",
      "day": { "en": "Tuesday", "fil": "Martes" },
      "category": "grades",
      "tags": ["academic", "deadline", "grading"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 21,
      "title": {
          "en": "Deliberation of Final List of Candidates for Midyear / November 2025 Graduation / 70th Commencement Exercises by Department/College/Graduate School",
          "fil": "Pagpapasya sa Pinal na Listahan ng mga Kandidato para sa Midyear / Nobyembre 2025 Pagtatapos / ika-70 na Seremonya ng Pagtatapos ng Kagawaran/Kolehiyo/Graduate School"
      },
      "description": {
          "en": "A thorough review and approval process by each department, college, or graduate school of the final list of student candidates for the Midyear / November 2025 Graduation and the 70th Commencement Exercises.",
          "fil": "Isang proseso ng masusing pagsusuri at pag-apruba ng bawat departamento, kolehiyo, o graduate school sa pinal na listahan ng mga estudyanteng kandidato para sa pagtatapos sa Midyear / Nobyembre 2025 at sa ika-70 na Seremonya ng Pagtatapos."
      },
      "date": "2025-12-11",
      "day": { "en": "Thursday", "fil": "Huwebes" },
      "category": "graduation",
      "tags": ["academic", "graduation"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 22,
      "title": {
          "en": "Presentation of Final List of Candidates for Midyear / November 2025 Graduation / 70th Commencement Exercises before the Academic Council",
          "fil": "Pagtatanghal ng Pinal na Listahan ng mga Kandidato para sa Midyear / Nobyembre 2025 Pagtatapos / ika-70 na Seremonya ng Pagtatapos sa harap ng Academic Council"
      },
      "description": {
          "en": "Isang pormal na presentasyon ng pinal na listahan ng mga estudyanteng kandidato para sa pagtatapos sa Midyear / Nobyembre 2025 at sa ika-70 na Seremonya ng Pagtatapos, na isinasagawa sa harap ng Academic Council para sa pagsusuri at pinal na pag-apruba.",
          "fil": "A formal presentation of the final list of student candidates for the Midyear / November 2025 Graduation and the 70th Commencement Exercises before the Academic Council for review and final approval."
      },
      "date": "4th Quarter 2025",
      "day": { "en": "Monday to Friday", "fil": "Lunes hanggang Biyernes" },
      "category": "academic",
      "tags": ["academic", "graduation"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 23,
      "title": {
          "en": "Midyear (November) 2025 Graduation / 70th Commencement Exercises",
          "fil": "Pagtatapos sa Midyear (Nobyembre) 2025 / ika-70 na Seremonya ng Pagtatapos"
      },
      "description": {
          "en": "A formal graduation ceremony held during Midyear (November) to confer diplomas and recognize students who have successfully completed their academic programs for Academic Year 2025-2026.",
          "fil": "Isang pormal na seremonya ng pagtatapos na ginaganap tuwing Midyear (Nobyembre) upang igawad ang mga diploma at pagkilala sa mga estudyanteng matagumpay na nakatapos ng kanilang mga kurso sa ilalim ng taong akademiko 2025-2026."
      },
      "date": "2025-12-17",
      "day": { "en": "Wednesday", "fil": "Miyerkules" },
      "category": "graduation",
      "tags": ["academic", "graduation"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 24,
      "title": {
        "en": "Online Enrollment Period for College Students (old and new)",
        "fil": "Panahon ng Pagpapatala Online para sa mga Mag-aaral sa Kolehiyo (Balik-Mag-aaral at Bagong Mag-aaral)"
      },
      "description": {
        "en": "Enrollment period for both new and returning college students.",
        "fil": "Panahon ng pagpapatala para sa mga bagong mag-aaral at mga nagbabalik na mag-aaral sa kolehiyo."
      },
      "date": "2025-12-9",
      "day": { "en": "Tuesday", "fil": "Martes" },
      "category": "enrollment",
      "tags": ["academic", "enrollment", "second semester"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 25,
      "title": {
          "en": "Filling of Letter Request for Special/Petition Class (SPC)/Evaluation Period",
          "fil": "Pagsusumite ng Sulat para sa Special/Petition Class (SPC) / Panahon ng Ebalwasyon"
      },
      "description": {
          "en": "Students may file SPC letters and undergo evaluation during this period.",
          "fil": "Maaaring magsumite ng liham para sa SPC at sumailalim sa ebalwasyon ang mga estudyante sa panahong ito."
      },
      "date": "2025-12-09 to 2025-12-12",
      "day": { "en": "Tuesday to Friday", "fil": "Martes hanggang Biyernes" },
      "category": "enrollment",
      "tags": ["enrollment", "midyear", "special class", "evaluation"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 26,
      "title": {
          "en": "First Day of Service of Faculty / First Day of Regular Classes",
          "fil": "Unang Araw ng Serbisyo ng mga Guro / Unang Araw ng Regular na Klase"
      },
      "description": {
          "en": "Start of faculty duties and beginning of regular classes for 2nd semester AY 2025–2026.",
          "fil": "Pagbabalik serbisyo ng mga guro at pagsisimula ng regular na klase para sa 2nd Semester, AY 2025–2026."
      },
      "date": "2025-12-15",
      "day": { "en": "Monday", "fil": "Lunes" },
      "category": "academic",
      "tags": ["academic", "classes", "faculty"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 27,
      "title": {
          "en": "Last Day of Adding/Changing of Subjects",
          "fil": "Huling Araw ng Pagdaragdag/Pagpapalit ng Asignatura"
      },
      "description": {
          "en": "Final day to add or change subjects for the 2nd semester.",
          "fil": "Huling araw ng pagdaragdag o pagpapalit ng mga asignatura para sa ikalawang semestre."
      },
      "date": "2025-12-19",
      "day": { "en": "Friday", "fil": "Biyernes" },
      "category": "academic",
      "tags": ["academic", "enrollment", "subjects"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 28,
      "title": {
          "en": "2nd Semester AY 2025-2026",
          "fil": "Ikalawang Semestre AY 2025-2026"
      },
      "description": {
          "en": "Official class period for the 2nd semester of AY 2025–2026.",
          "fil": "Opisyal na panahon ng klase para sa ikalawang semestre ng AY 2025–2026."
      },
      "date": "2025-12-15 to 2026-04-25",
      "day": { "en": "Monday to Saturday", "fil": "Lunes hanggang Sabado" },
      "category": "academic",
      "tags": ["academic", "semester", "classes"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 29,
      "title": {
          "en": "Last Day of Dropping of Subjects",
          "fil": "Huling Araw ng Pag-drop ng Asignatura"
      },
      "description": {
          "en": "Deadline for students to drop subjects.",
          "fil": "Huling araw ng pag-drop ng asignatura ng mga estudyante."
      },
      "date": "2026-02-09",
      "day": { "en": "Monday", "fil": "Lunes" },
      "category": "academic",
      "tags": ["academic", "deadline", "subjects"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 30,
      "title": {
          "en": "Last Day of Settlement of Admission Requirements for New Students (2nd Semester)",
          "fil": "Huling Araw ng Pagsumite ng Admission Requirements ng mga Bagong Mag-aaral (Ika-2 Semestre)"
      },
      "description": {
          "en": "Final day for new students to submit admission requirements for the 2nd semester.",
          "fil": "Huling araw ng pagsusumite ng admission requirements para sa mga bagong estudyante sa ikalawang semestre."
      },
      "date": "2026-02-09 to 2026-02-13",
      "day": { "en": "Monday to Friday", "fil": "Lunes hanggang Biyernes" },
      "category": "admission",
      "tags": ["admission", "academic", "deadline"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 31,
      "title": {
          "en": "Midterm Examination",
          "fil": "Pagsusulit sa Midterm"
      },
      "description": {
          "en": "Midterm examinations for all enrolled students.",
          "fil": "Pagsusulit sa Midterm para sa lahat ng naka-enroll na mga estudyante."
      },
      "date": "2026-02-19 to 2026-02-21",
      "day": { "en": "Thursday to Saturday", "fil": "Huwebes hanggang Sabado" },
      "category": "academic",
      "tags": ["academic", "examination", "midterm"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 32,
      "title": {
          "en": "Filing of Application for April 2026 Graduation / 70th Commencement Exercises",
          "fil": "Pagsusumite ng Aplikasyon para sa Pagtatapos sa Abril 2026 / ika-70 Pagtatapos"
      },
      "description": {
          "en": "Deadline for filing graduation applications for April 2026 commencement exercises.",
          "fil": "Huling petsa para sa pagsusumite ng aplikasyon sa graduation para sa pagtatapos sa Abril 2026."
      },
      "date": "2026-02-23 to 2026-03-06",
      "day": {
          "en": "Monday to Friday",
          "fil": "Lunes hanggang Biyernes"
      },
      "category": "academic",
      "tags": ["academic", "graduation", "application", "commencement"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 33,
      "title": {
          "en": "Presentation of Final List of Candidates for April 2026 Graduation / 70th Commencement Exercises before the Academic Council",
          "fil": "Presentasyon ng Huling Listahan ng mga Magsisipagtapos sa Abril 2026 / Ika-70 na Pagtatapos sa Academic Council"
      },
      "description": {
          "en": "Presentation of the final list of graduation candidates to the University's Academic Council.",
          "fil": "Pagpapakita ng huling listahan ng mga magsisipagtapos sa Academic Council ng Unibersidad."
      },
      "date": "2026-02",
      "day": {
          "en": "2nd Quarter 2026",
          "fil": "Ikalawang Markahan ng 2026"
      },
      "category": "academic",
      "tags": ["academic", "graduation", "academic-council", "candidates"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 34,
      "title": {
          "en": "Final Examination",
          "fil": "Huling Pagsusulit"
      },
      "description": {
          "en": "Final examinations for the 2nd semester for all enrolled students.",
          "fil": "Huling pagsusulit sa ikalawang semestre para sa lahat ng naka-enroll na mga estudyante."
      },
      "date": "2026-04-23 to 2026-04-25",
      "day": {
          "en": "Thursday to Saturday",
          "fil": "Huwebes hanggang Sabado"
      },
      "category": "academic",
      "tags": ["academic", "examination", "final"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 35,
      "title": {
          "en": "Deliberation of Final List of Candidates for May 2026 Graduation / 70th Commencement Exercises by Department/College",
          "fil": "Pagpupulong para sa Huling Listahan ng mga Magsisispagtapos sa Mayo 2026 / Ikaw-70 Pagtatapos ng bawat Departamento/Kolehiyo."
      },
      "description": {
          "en": "University's department/college deliberation on final graduation candidates list.",
          "fil": "Pagpupulong ng mga departamento/kolehiyo ng unibersidad sa huling listahan ng mga magsisipagtapos."
      },
      "date": "2026-05-13",
      "day": {
          "en": "Wednesday",
          "fil": "Miyerkules"
      },
      "category": "academic",
      "tags": ["academic", "graduation", "deliberation"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 36,
      "title": {
          "en": "Deliberation of Final List of Graduating Students by the Committee on Students' Records",
          "fil": "Pagpupulong ng Committee sa Students' Records sa Huling Listahan ng mga Magsisipagtapos"
      },
      "description": {
          "en": "Committee deliberation on the final list of graduating students.",
          "fil": "Pagpupulong ng komite sa huling listahan ng mga magsisipagtapos."
      },
      "date": "2026-05-14",
      "day": {
          "en": "Thursday",
          "fil": "Huwebes"
      },
      "category": "academic",
      "tags": ["academic", "graduation", "committee", "students-records"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 37,
      "title": {
          "en": "End of 2nd Semester AY 2025-2026 and Last Day of Completion of Incomplete (INC.) Rating",
          "fil": "Huling Araw ng 2nd Semester, AY 2025-2026 at Pagkumpleto ng Incomplete (INC.) Rating"
      },
      "description": {
          "en": "End of second semester and deadline for completing incomplete ratings from previous semester.",
          "fil": "Pagtatapos ng ikalawang semestre at huling araw para sa pagkumpleto ng mga incomplete rating mula sa nagdaang semestre."
      },
      "date": "2026-04-24",
      "day": {
          "en": "Friday",
          "fil": "Biyernes"
      },
      "category": "academic",
      "tags": ["academic", "semester-end", "incomplete-rating", "deadline"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 38,
      "title": {
          "en": "Submission of Final Manuscript (Thesis/Dissertation) of Candidates for April 2026 Graduation",
          "fil": "Pagsusumite ng Pinal na Manuscript (Thesis/Dissertation) ng mga Magsisipagtapos sa Abril 2026"
      },
      "description": {
          "en": "Deadline for submitting final thesis or dissertation manuscripts for April graduation 2026.",
          "fil": "Huling petsa para sa pagsusumite ng pinal na thesis o dissertation manuscript para sa graduation sa Abril 2026."
      },
      "date": "2026-04-28",
      "day": {
          "en": "Tuesday",
          "fil": "Martes"
      },
      "category": "academic",
      "tags": [
          "academic",
          "thesis",
          "dissertation",
          "manuscript",
          "graduation"
      ],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 39,
      "title": {
          "en": "Last Day of Online Posting of Grades by Faculty Members / Submission of Official Grading Sheets for Graduating and Non-Graduating Students/Last Day of Service of Faculty",
          "fil": "Huling Araw ng Pag-post Online ng mga Grado ng mga Faculty Members / Pagsusumite ng Official Grading Sheets para sa mga graduating at non-graduating na mga Estudyante/Huling Araw ng Serbisyo ng Faculty"
      },
      "description": {
          "en": "Final deadline for faculty to submit grades online and official grading sheets.",
          "fil": "Huling araw para sa mga faculty ng pagsusumite ng mga grado online at opisyal na talaang ng marka"
      },
      "date": "2026-05-10",
      "day": {
          "en": "Sunday",
          "fil": "Linggo"
      },
      "category": "academic",
      "tags": ["academic", "grades", "faculty", "grading-sheets", "deadline"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 40,
      "title": {
          "en": "Submission of Official Grading Sheets (hardcopies) to ARO",
          "fil": "Pagsusumite ng Official Grading Sheets (nakalimbag na kopya) sa ARO"
      },
      "description": {
          "en": "Submission of physical copies of official grading sheets to the Academic Records Office.",
          "fil": "Pagsusumite ng mga nakalimbag na kopya ng mga opisyal na talaan ng marka sa Tanggapan ng Mga Akademikong Rekord."
      },
      "date": "2026-05-11",
      "day": {
          "en": "Monday",
          "fil": "Lunes"
      },
      "category": "academic",
      "tags": ["academic", "grading-sheets", "ARO", "hardcopy", "submission"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 41,
      "title": {
          "en": "April 2026 Graduation / 70th Commencement Exercises",
          "fil": "Pagtatapos sa Abril 2026 / Ika-70 na Pagtatapos"
      },
      "description": {
          "en": "Graduation ceremony and 70th commencement exercises.",
          "fil": "Seremonya ng mga Magsisipagtapos at Ika-70 Pagtatapos."
      },
      "date": "2026-05-28",
      "day": {
          "en": "Thursday",
          "fil": "Huwebes"
      },
      "category": "academic",
      "tags": ["academic", "graduation", "commencement", "ceremony"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 42,
      "title": {
          "en": "Filing of Request for SPCs / Evaluation of SPCs",
          "fil": "Pagsusumite ng Request para sa SPCs o Ebalwasyon ng SPCs"
      },
      "description": {
          "en": "Period for filing requests and evaluation of Subject/Course Permits (SPCs).",
          "fil": "Panahon para sa pagsusumite ng mga request at ebalwasyon ng mga Subject/Course Permits (SPCs)."
      },
      "date": "2026-05-13 to 2026-05-15",
      "day": {
          "en": "Wednesday to Friday",
          "fil": "Miyerkules hanggang Biyernes"
      },
      "category": "academic",
      "tags": ["academic", "SPC", "evaluation", "permits"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 43,
      "title": {
          "en": "Online Admission of Transferees, Returning and Graduate Students for MidyearTerm 2026",
          "fil": "Online na Pagtatala ng mga Transferees, Returning at Graduate Students para sa MidyearTerm 2026"
      },
      "description": {
          "en": "Online admission period for transferee, returning, and graduate students for midyear term.",
          "fil": "Panahon ng online na pagtatala para sa mga transferee, returning, at graduate students para sa midyear term."
      },
      "date": "2026-05-12 to 2026-05-13",
      "day": {
          "en": "Tuesday to Wednesday",
          "fil": "Martes hanggang Miyerkules"
      },
      "category": "admission",
      "tags": [
          "academic",
          "admission",
          "online",
          "transferees",
          "graduate",
          "midyear"
      ],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 44,
      "title": {
          "en": "Online Regular Enrollment Period",
          "fil": "Panahon ng Regular na Online na Pagpapatala"
      },
      "description": {
          "en": "Regular online enrollment period for the upcoming term.",
          "fil": "Panahon ng regular na online na pagpapatala para sa darating na termino."
      },
      "date": "2026-05-14 to 2026-05-15",
      "day": {
          "en": "Thursday to Friday",
          "fil": "Huwebes hanggang Biyernes"
      },
      "category": "enrollment",
      "tags": ["academic", "enrollment", "online", "regular"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 45,
      "title": {
          "en": "Last Day of Adding/Changing of Subjects",
          "fil": "Huling Araw ng Pagdagdag/Pagbabago ng mga Asignatura"
      },
      "description": {
          "en": "Final deadline for adding or changing subjects for undergraduate and graduate students.",
          "fil": "Huling araw para sa pagdagdag o pagbabago ng mga asignatura para sa mga undergraduate at graduate na estudyante."
      },
      "date": "2026-05-22 and 2026-05-29",
      "day": {
          "en": "Friday (UGS: May 22, GS: May 29)",
          "fil": "Biyernes (UGS: Mayo 22, GS: Mayo 29)"
      },
      "category": "academic",
      "tags": ["academic", "registration", "subjects", "midyear", "deadline"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 46,
      "title": {
          "en": "Last Day of Dropping of Subjects",
          "fil": "Huling Araw ng Pag-drop ng mga Asignatura"
      },
      "description": {
          "en": "Final deadline for dropping subjects during the midyear term.",
          "fil": "Huling Araw para sa pag-drop ng mga asignatura sa midyear term."
      },
      "date": "2026-05-25",
      "day": {
          "en": "Monday",
          "fil": "Lunes"
      },
      "category": "academic",
      "tags": [
          "academic",
          "registration",
          "subjects",
          "dropping",
          "midyear",
          "deadline"
      ],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 47,
      "title": {
          "en": "Last Day of Settlement of Admission Requirements of New Students Enrolled During the Midyear Term (May-June) 2026",
          "fil": "Huling Araw ng Pagsasaayos ng mga Kinakailangang Dokumento sa Admission ng mga Bagong Estudyanteng Nag-enroll sa Midyear Term (Mayo-Hunyo) 2026"
      },
      "description": {
          "en": "Final deadline for new students to complete all admission requirements for midyear term enrollment.",
          "fil": "Huling araw para sa mga bagong estudyante na makumpleto ang lahat ng mga kinakailangang ipasa sa admission para sa midyear term."
      },
      "date": "2026-06-04",
      "day": {
          "en": "Wednesday",
          "fil": "Miyerkules"
      },
      "category": "academic",
      "tags": [
          "academic",
          "admission",
          "requirements",
          "new-students",
          "midyear"
      ],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 48,
      "title": {
          "en": "Midterm Examination - Midyear Term",
          "fil": "Pagsusulit sa Kalagitnaan ng Termino - Midyear Term"
      },
      "description": {
          "en": "Midterm examinations for undergraduate or graduate students during midyear term.",
          "fil": "Pagsusulit sa kalagitnaan ng termino para sa mga undergraduate at graduate na estudyante sa midyear term."
      },
      "date": "2026-06-05 to 2026-06-15",
      "day": {
          "en": "Thursday to Sabado (UGS: June 5-7), Saturday to Sunday (GS: June 14-15)",
          "fil": "Huwebes hanggang Sabado (UGS: Hunyo 5-7), Sabado hanggang Linggo (GS: Hunyo 14-15)"
      },
      "category": "academic",
      "tags": ["academic", "examination", "midterm", "midyear"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 49,
      "title": {
          "en": "Final Examination - Midyear Term",
          "fil": "Huling Pagsusulit - Midyear Term"
      },
      "description": {
          "en": "Final examinations for undergraduate and graduate students during midyear term.",
          "fil": "Huling pagsusulit para sa mga undergraduate at graduate na estudyante sa midyear term."
      },
      "date": "2026-06-26 to 2026-06-29",
      "day": {
          "en": "Thursday to Linggo (UGS: June 26-28, GS: June 28-29)",
          "fil": "Huwebes hanggang Linggo (UGS: Hunyo 26-28, GS: Hunyo 28-29)"
      },
      "category": "academic",
      "tags": ["academic", "examination", "final", "midyear"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 50,
      "title": {
          "en": "End of Midyear Term (May-June) 2026 and Last Day of Completion of Incomplete (INC.) Rating",
          "fil": "Katapusan ng Midyear Term (Mayo-Hunyo) 2026 at Huling Araw ng Pagkumpleto ng Incomplete (INC.) Rating"
      },
      "description": {
          "en": "End of midyear term and final deadline for completing incomplete ratings from previous terms.",
          "fil": "Katapusan ng midyear term at huling araw para sa pagkumpleto ng mga incomplete rating mula sa mga nagdaang termino."
      },
      "date": "2026-06-27",
      "day": {
          "en": "Saturday",
          "fil": "Sabado"
      },
      "category": "academic",
      "tags": [
          "academic",
          "term-end",
          "incomplete-rating",
          "midyear",
          "deadline"
      ],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 51,
      "title": {
          "en": "Last Day of Online Posting of Grades of Faculty",
          "fil": "Huling Araw ng mga Faculty sa Pagpost Online ng mga Grado"
      },
      "description": {
          "en": "Final deadline for faculty members to post grades online for midyear term.",
          "fil": "Huling araw para sa mga miyembro ng faculty na mag-post ng mga grado online para sa midyear term."
      },
      "date": "2026-07-05",
      "day": {
          "en": "Sunday",
          "fil": "Linggo"
      },
      "category": "academic",
      "tags": ["academic", "grades", "faculty", "online-posting", "deadline"],
      "isFeatured": false,
      "isTrending": false
    },
    {
      "id": 52,
      "title": {
          "en": "Submission of Official Grading Sheets (hardcopies) to ARO",
          "fil": "Pagsusumite ng Opisyal na Talaan ng mga Marka (Nakalimbag na Kopya) sa ARO"
      },
      "description": {
          "en": "Submission of physical copies of official grading sheets to the Academic Records Office for midyear term.",
          "fil": "Pagsusumite ng mga pisikal na kopya ng mga Talaan ng Marka sa Tanggapan ng Pang-Akademikong Rekord para sa midyear term."
      },
      "date": "2026-07-06",
      "day": {
          "en": "Monday",
          "fil": "Lunes"
      },
      "category": "academic",
      "tags": ["academic", "grading-sheets", "ARO", "hardcopy", "submission"],
      "isFeatured": false,
      "isTrending": false
    }
],
  "campusLife": [
    {
      "id": 1,
      "title": {
        "en": "CICS Life: Coding Nights & Coffee Breaks",
        "fil": "Buhay CICS: Mga Gabi ng Pag-cocode at Kape"
      },
      "description": {
        "en": "A glimpse into the vibrant student life at CICS, from hackathons to late-night study sessions.",
        "fil": "Sulyap sa makulay na buhay-estudyante sa CICS, mula hackathon hanggang puyatan."
      },
      "imageUrl": "/images/campuslife/cicslife1.jpg",
      "gallery": [
        "/images/campuslife/cicslife1.jpg",
        "/images/campuslife/cicslife2.jpg"
      ],
      "date": "2025-06-01",
      "author": "Student Council",
      "tags": ["cics", "cicslife", "studentlife"],
      "isFeatured": true,
      "isTrending": true,
      "submittedByUser": false,
      "content": {
        "en": "From coding marathons to spontaneous coffee breaks, CICS students know how to balance work and play!",
        "fil": "Mula coding marathon hanggang biglaang kapehan, marunong magbalanse ng saya at aral ang mga taga-CICS!"
      }
    },
    {
      "id": 2,
      "title": {
        "en": "Intramurals 2025: Champions Rise!",
        "fil": "Intramurals 2025: Mga Kampeon!"
      },
      "description": {
        "en": "Highlights from the university-wide sports fest.",
        "fil": "Mga tampok sa paligsahan ng buong unibersidad."
      },
      "imageUrl": "/images/campuslife/intramurals2025.jpg",
      "gallery": ["/images/campuslife/intramurals2025.jpg"],
      "date": "2025-03-15",
      "author": "Athletics Dept.",
      "tags": ["sports", "intramurals", "trending"],
      "isFeatured": false,
      "isTrending": true,
      "submittedByUser": false,
      "content": {
        "en": "The energy, the cheers, and the victories—Intramurals 2025 brought everyone together!",
        "fil": "Ang sigla, hiyawan, at tagumpay—pinagbuklod ng Intramurals 2025 ang lahat!"
      }
    },
    {
      "id": 3,
      "title": {
        "en": "Share Your Campus Story!",
        "fil": "Ibahagi ang Iyong Kuwento!"
      },
      "description": {
        "en": "Submit your own campus life story, photo, or event.",
        "fil": "Ipadala ang iyong sariling kwento, larawan, o kaganapan."
      },
      "imageUrl": "/images/campuslife/submit.jpg",
      "gallery": [],
      "date": "2025-06-19",
      "author": "User Submission",
      "tags": ["submission", "studentlife"],
      "isFeatured": false,
      "isTrending": false,
      "submittedByUser": true,
      "content": {
        "en": "Want to be featured? Submit your campus life experience here!",
        "fil": "Gusto mong ma-feature? Ipadala ang iyong campus life experience dito!"
      }
    }
  ],
  "news": [
    {
      "id": 1,
      "imgUrl": "../../images/news/marsu-the-world-ranking-4.jpg",
      "gallery": [
        "../../images/news/marsu-the-world-ranking-1.jpg",
        "../../images/news/marsu-the-world-ranking-2.jpg",
        "../../images/news/marsu-the-world-ranking-3.jpg",
        "../../images/news/marsu-the-world-ranking-4.jpg"
      ],
      "title": {
        "en": "Marinduque State University Joins Times Higher Education World University Rankings 2025"
      },
      "date": "2025-06-18",
      "description": {
        "en": "MARSU has been officially listed in the Times Higher Education World University Rankings for 2025, marking a significant milestone in its academic journey."
      },
      "content": {
        "en": "MarSU earns global recognition for its commitment to sustainable and inclusive development\nBoac, Marinduque, Philippines Marinduque State University (MarSU), under the leadership of Prof. Dr. Diosdado P. Zulueta, proudly makes its debut in the Times Higher Education (THE) World University Rankings 2025, marking a historic milestone not only for the institution but also for the Province of Marinduque and the MIMAROPA Region.\nThe THE World University Rankings, established in 2010, is one of the most prestigious global performance assessments for higher education institutions. It evaluates universities based on five key pillars: teaching, research environment, research quality, industry engagement, and international outlook. The ranking aims to provide transparency and insights for students, educators, and policymakers across the globe.\nMarSU’s inclusion in this global list is a testament to its growing influence and commitment to academic excellence, research innovation, and global relevance. Most significantly, the university’s placement reflects its consistent efforts in advancing the United Nations’ 17 Sustainable Development Goals (SDGs)—from promoting quality education, gender equality, and climate action, to building partnerships that empower local and international communities.\nThis achievement affirms MarSU’s unwavering vision to be a transformative and globally engaged university that fosters inclusive development and sustainable impact. As it joins the ranks of the world’s recognized institutions, MarSU remains steadfast in its mission to shape future leaders who will contribute meaningfully to a better world"
      },
      "articleUrl": "/news/1",
      "isFeatured": true,
      "author": "MARSU Infromation Unit",
      "tags": [
        "University Rankings",
        "MARSU",
        "Global Recognition",
        "Sustainable Development Goals"
      ]
    }
  ],
  "linkages": [
    { "img": "partners/partner (1).jpg", "alt": "AAACU" },
    { "img": "partners/partner (2).jpg", "alt": "CHED" },
    { "img": "partners/partner (3).jpg", "alt": "DOST" },
    { "img": "partners/partner (4).jpg", "alt": "DSWD" },
    { "img": "partners/partner (5).jpg", "alt": "DSWD" },
    { "img": "partners/partner (6).jpg", "alt": "DSWD" },
    { "img": "partners/partner (7).jpg", "alt": "DSWD" },
    { "img": "partners/partner (8).jpg", "alt": "DSWD" },
    { "img": "partners/partner (9).jpg", "alt": "DSWD" },
    { "img": "partners/partner (10).jpg", "alt": "DSWD" },
    { "img": "partners/partner (11).jpg", "alt": "DSWD" },
    { "img": "partners/partner (12).jpg", "alt": "DSWD" },
    { "img": "partners/partner (13).jpg", "alt": "DSWD" },
    { "img": "partners/partner (14).jpg", "alt": "DSWD" },
    { "img": "partners/partner (15).jpg", "alt": "DSWD" },
    { "img": "partners/partner (16).jpg", "alt": "DSWD" },
    { "img": "partners/partner (17).jpg", "alt": "DSWD" },
    { "img": "partners/partner (18).jpg", "alt": "DSWD" },
    { "img": "partners/partner (19).jpg", "alt": "DSWD" },
    { "img": "partners/partner (20).jpg", "alt": "DSWD" },
    { "img": "partners/partner (21).jpg", "alt": "DSWD" },
    { "img": "partners/partner (1).png", "alt": "DSWD" },
    { "img": "partners/partner (2).png", "alt": "DSWD" },
    { "img": "partners/partner (3).png", "alt": "DSWD" },
    { "img": "partners/partner (4).png", "alt": "DSWD" },
    { "img": "partners/partner (5).png", "alt": "DSWD" },
    { "img": "partners/partner (6).png", "alt": "DSWD" },
    { "img": "partners/partner (7).png", "alt": "DSWD" },
    { "img": "partners/partner (8).png", "alt": "DSWD" },
    { "img": "partners/partner (9).png", "alt": "DSWD" },
    { "img": "partners/partner (10).png", "alt": "DSWD" },
    { "img": "partners/partner (11).png", "alt": "DSWD" },
    { "img": "partners/partner (12).png", "alt": "DSWD" },
    { "img": "partners/partner (13).png", "alt": "DSWD" },
    { "img": "partners/partner (14).png", "alt": "DSWD" }
  ]
}
